/* automatically generated by rust-bindgen 0.64.0 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const CTL_IMPL_MAJOR_VERSION: u32 = 1;
pub const CTL_IMPL_MINOR_VERSION: u32 = 1;
pub const CTL_MAX_DEVICE_NAME_LEN: u32 = 100;
pub const CTL_MAX_RESERVED_SIZE: u32 = 116;
pub const CTL_I2C_MAX_DATA_SIZE: u32 = 128;
pub const CTL_AUX_MAX_DATA_SIZE: u32 = 132;
pub const CTL_MAX_NUM_SAMPLES_PER_CHANNEL_1D_LUT: u32 = 8192;
pub const CTL_FAN_TEMP_SPEED_PAIR_COUNT: u32 = 32;
pub const CTL_PSU_COUNT: u32 = 5;
pub const CTL_FAN_COUNT: u32 = 5;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}

pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type max_align_t = f64;
#[doc = "\n @brief Supported initialization flags"]
pub type ctl_init_flags_t = u32;
#[doc = "< Use Level0 or not. This is usually required for telemetry,\n< performance, frequency related APIs"]
pub const _ctl_init_flag_t_CTL_INIT_FLAG_USE_LEVEL_ZERO: _ctl_init_flag_t = 1;
pub const _ctl_init_flag_t_CTL_INIT_FLAG_MAX: _ctl_init_flag_t = -2147483648;
pub type _ctl_init_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_init_flag_t as ctl_init_flag_t;
#[doc = "\n @brief Version information"]
pub type ctl_version_info_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_api_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a control API instance"]
pub type ctl_api_handle_t = *mut _ctl_api_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_device_adapter_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a device adapter instance"]
pub type ctl_device_adapter_handle_t = *mut _ctl_device_adapter_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_temp_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a device temperature sensor"]
pub type ctl_temp_handle_t = *mut _ctl_temp_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_freq_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle for a device frequency domain"]
pub type ctl_freq_handle_t = *mut _ctl_freq_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pwr_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a power device."]
pub type ctl_pwr_handle_t = *mut _ctl_pwr_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_fan_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a device fan"]
pub type ctl_fan_handle_t = *mut _ctl_fan_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_mem_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a device memory module"]
pub type ctl_mem_handle_t = *mut _ctl_mem_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_engine_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a device engine group"]
pub type ctl_engine_handle_t = *mut _ctl_engine_handle_t;
#[doc = "\n @brief Base for all properties types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_base_interface_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
}
#[test]
fn bindgen_test_layout__ctl_base_interface_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_base_interface_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_base_interface_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_base_interface_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_base_interface_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_base_interface_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_base_interface_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_base_interface_t),
            "::",
            stringify!(Version)
        )
    );
}
#[doc = "\n @brief Base for all properties types"]
pub type ctl_base_interface_t = _ctl_base_interface_t;
#[doc = "< Boolean"]
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_BOOL: _ctl_property_value_type_t = 0;
#[doc = "< Float"]
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_FLOAT: _ctl_property_value_type_t = 1;
#[doc = "< Int32"]
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_INT32: _ctl_property_value_type_t = 2;
#[doc = "< Unsigned Int32"]
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_UINT32: _ctl_property_value_type_t = 3;
#[doc = "< Enum"]
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_ENUM: _ctl_property_value_type_t = 4;
#[doc = "< Custom argument"]
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_CUSTOM: _ctl_property_value_type_t = 5;
pub const _ctl_property_value_type_t_CTL_PROPERTY_VALUE_TYPE_MAX: _ctl_property_value_type_t = 6;
#[doc = "\n @brief Value type"]
pub type _ctl_property_value_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Value type"]
pub use self::_ctl_property_value_type_t as ctl_property_value_type_t;
#[doc = "\n @brief Property range details, a generic struct to hold min/max/step size\n        information of various feature properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_range_info_t {
    #[doc = "< [out] Minimum possible value"]
    pub min_possible_value: f32,
    #[doc = "< [out] Maximum possible value"]
    pub max_possible_value: f32,
    #[doc = "< [out] Step size possible"]
    pub step_size: f32,
    #[doc = "< [out] Default value"]
    pub default_value: f32,
}
#[test]
fn bindgen_test_layout__ctl_property_range_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_range_info_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_range_info_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_property_range_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_range_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_range_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_possible_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_t),
            "::",
            stringify!(min_possible_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_possible_value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_t),
            "::",
            stringify!(max_possible_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_t),
            "::",
            stringify!(step_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_t),
            "::",
            stringify!(default_value)
        )
    );
}
#[doc = "\n @brief Property range details, a generic struct to hold min/max/step size\n        information of various feature properties"]
pub type ctl_property_range_info_t = _ctl_property_range_info_t;
#[doc = "\n @brief Property range details of integer type, a generic struct to hold\n        min/max/step size information of various feature properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_range_info_int_t {
    #[doc = "< [out] Minimum possible value"]
    pub min_possible_value: i32,
    #[doc = "< [out] Maximum possible value"]
    pub max_possible_value: i32,
    #[doc = "< [out] Step size possible"]
    pub step_size: i32,
    #[doc = "< [out] Default value"]
    pub default_value: i32,
}
#[test]
fn bindgen_test_layout__ctl_property_range_info_int_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_range_info_int_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_range_info_int_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_property_range_info_int_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_range_info_int_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_range_info_int_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_possible_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_int_t),
            "::",
            stringify!(min_possible_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_possible_value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_int_t),
            "::",
            stringify!(max_possible_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_int_t),
            "::",
            stringify!(step_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_int_t),
            "::",
            stringify!(default_value)
        )
    );
}
#[doc = "\n @brief Property range details of integer type, a generic struct to hold\n        min/max/step size information of various feature properties"]
pub type ctl_property_range_info_int_t = _ctl_property_range_info_int_t;
#[doc = "\n @brief Property range details of unsigned integer type, a generic struct to\n        hold min/max/step size information of various feature properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_range_info_uint_t {
    #[doc = "< [out] Minimum possible value"]
    pub min_possible_value: u32,
    #[doc = "< [out] Maximum possible value"]
    pub max_possible_value: u32,
    #[doc = "< [out] Step size possible"]
    pub step_size: u32,
    #[doc = "< [out] Default value"]
    pub default_value: u32,
}
#[test]
fn bindgen_test_layout__ctl_property_range_info_uint_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_range_info_uint_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_range_info_uint_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_property_range_info_uint_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_range_info_uint_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_range_info_uint_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_possible_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_uint_t),
            "::",
            stringify!(min_possible_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_possible_value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_uint_t),
            "::",
            stringify!(max_possible_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_uint_t),
            "::",
            stringify!(step_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_range_info_uint_t),
            "::",
            stringify!(default_value)
        )
    );
}
#[doc = "\n @brief Property range details of unsigned integer type, a generic struct to\n        hold min/max/step size information of various feature properties"]
pub type ctl_property_range_info_uint_t = _ctl_property_range_info_uint_t;
#[doc = "\n @brief Bool feature details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_info_boolean_t {
    #[doc = "< [out] Default state"]
    pub DefaultState: bool,
}
#[test]
fn bindgen_test_layout__ctl_property_info_boolean_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_info_boolean_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_info_boolean_t>(),
        1usize,
        concat!("Size of: ", stringify!(_ctl_property_info_boolean_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_info_boolean_t>(),
        1usize,
        concat!("Alignment of ", stringify!(_ctl_property_info_boolean_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultState) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_boolean_t),
            "::",
            stringify!(DefaultState)
        )
    );
}
#[doc = "\n @brief Bool feature details"]
pub type ctl_property_info_boolean_t = _ctl_property_info_boolean_t;
#[doc = "\n @brief Bool feature for get/set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_boolean_t {
    #[doc = "< [in,out] Enable"]
    pub Enable: bool,
}
#[test]
fn bindgen_test_layout__ctl_property_boolean_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_boolean_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_boolean_t>(),
        1usize,
        concat!("Size of: ", stringify!(_ctl_property_boolean_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_boolean_t>(),
        1usize,
        concat!("Alignment of ", stringify!(_ctl_property_boolean_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_boolean_t),
            "::",
            stringify!(Enable)
        )
    );
}
#[doc = "\n @brief Bool feature for get/set"]
pub type ctl_property_boolean_t = _ctl_property_boolean_t;
#[doc = "\n @brief Enumeration feature details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_info_enum_t {
    #[doc = "< [out] Supported possible values represented as a bitmask"]
    pub SupportedTypes: u64,
    #[doc = "< [out] Default type"]
    pub DefaultType: u32,
}
#[test]
fn bindgen_test_layout__ctl_property_info_enum_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_info_enum_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_info_enum_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_property_info_enum_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_info_enum_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_property_info_enum_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedTypes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_enum_t),
            "::",
            stringify!(SupportedTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_enum_t),
            "::",
            stringify!(DefaultType)
        )
    );
}
#[doc = "\n @brief Enumeration feature details"]
pub type ctl_property_info_enum_t = _ctl_property_info_enum_t;
#[doc = "\n @brief Enumeration feature for get/set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_enum_t {
    #[doc = "< [in,out] Enable with specific type"]
    pub EnableType: u32,
}
#[test]
fn bindgen_test_layout__ctl_property_enum_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_enum_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_enum_t>(),
        4usize,
        concat!("Size of: ", stringify!(_ctl_property_enum_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_enum_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_enum_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnableType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_enum_t),
            "::",
            stringify!(EnableType)
        )
    );
}
#[doc = "\n @brief Enumeration feature for get/set"]
pub type ctl_property_enum_t = _ctl_property_enum_t;
#[doc = "\n @brief Float feature details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_info_float_t {
    #[doc = "< [in,out] DefaultEnable"]
    pub DefaultEnable: bool,
    #[doc = "< [out] Min/max/default/step details"]
    pub RangeInfo: ctl_property_range_info_t,
}
#[test]
fn bindgen_test_layout__ctl_property_info_float_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_info_float_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_info_float_t>(),
        20usize,
        concat!("Size of: ", stringify!(_ctl_property_info_float_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_info_float_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_info_float_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultEnable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_float_t),
            "::",
            stringify!(DefaultEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RangeInfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_float_t),
            "::",
            stringify!(RangeInfo)
        )
    );
}
#[doc = "\n @brief Float feature details"]
pub type ctl_property_info_float_t = _ctl_property_info_float_t;
#[doc = "\n @brief Float feature for get/set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_float_t {
    #[doc = "< [in,out] Enable"]
    pub Enable: bool,
    #[doc = "< [in,out] Value"]
    pub Value: f32,
}
#[test]
fn bindgen_test_layout__ctl_property_float_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_float_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_float_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_property_float_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_float_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_float_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_float_t),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_float_t),
            "::",
            stringify!(Value)
        )
    );
}
#[doc = "\n @brief Float feature for get/set"]
pub type ctl_property_float_t = _ctl_property_float_t;
#[doc = "\n @brief Int32 feature details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_info_int_t {
    #[doc = "< [in,out] DefaultEnable"]
    pub DefaultEnable: bool,
    #[doc = "< [out] Min/max/default/step details"]
    pub RangeInfo: ctl_property_range_info_int_t,
}
#[test]
fn bindgen_test_layout__ctl_property_info_int_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_info_int_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_info_int_t>(),
        20usize,
        concat!("Size of: ", stringify!(_ctl_property_info_int_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_info_int_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_info_int_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultEnable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_int_t),
            "::",
            stringify!(DefaultEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RangeInfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_int_t),
            "::",
            stringify!(RangeInfo)
        )
    );
}
#[doc = "\n @brief Int32 feature details"]
pub type ctl_property_info_int_t = _ctl_property_info_int_t;
#[doc = "\n @brief Int32 feature for get/set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_int_t {
    #[doc = "< [in,out] Enable"]
    pub Enable: bool,
    #[doc = "< [in,out] Value"]
    pub Value: i32,
}
#[test]
fn bindgen_test_layout__ctl_property_int_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_int_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_int_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_property_int_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_int_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_int_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_int_t),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_int_t),
            "::",
            stringify!(Value)
        )
    );
}
#[doc = "\n @brief Int32 feature for get/set"]
pub type ctl_property_int_t = _ctl_property_int_t;
#[doc = "\n @brief Int32 feature details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_info_uint_t {
    #[doc = "< [in,out] DefaultEnable"]
    pub DefaultEnable: bool,
    #[doc = "< [out] Min/max/default/step details"]
    pub RangeInfo: ctl_property_range_info_uint_t,
}
#[test]
fn bindgen_test_layout__ctl_property_info_uint_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_info_uint_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_info_uint_t>(),
        20usize,
        concat!("Size of: ", stringify!(_ctl_property_info_uint_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_info_uint_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_info_uint_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultEnable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_uint_t),
            "::",
            stringify!(DefaultEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RangeInfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_uint_t),
            "::",
            stringify!(RangeInfo)
        )
    );
}
#[doc = "\n @brief Int32 feature details"]
pub type ctl_property_info_uint_t = _ctl_property_info_uint_t;
#[doc = "\n @brief Int32 feature for get/set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_property_uint_t {
    #[doc = "< [in,out] Enable"]
    pub Enable: bool,
    #[doc = "< [in,out] Value"]
    pub Value: u32,
}
#[test]
fn bindgen_test_layout__ctl_property_uint_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_uint_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_uint_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_property_uint_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_uint_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_uint_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_uint_t),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_uint_t),
            "::",
            stringify!(Value)
        )
    );
}
#[doc = "\n @brief Int32 feature for get/set"]
pub type ctl_property_uint_t = _ctl_property_uint_t;
#[doc = "\n @brief Feature element details, union of bool/float/enum property_info\n        structs. Used for feature specific capability check"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ctl_property_info_t {
    #[doc = "< [in,out] Boolean type fields"]
    pub BoolType: ctl_property_info_boolean_t,
    #[doc = "< [in,out] Float type fields"]
    pub FloatType: ctl_property_info_float_t,
    #[doc = "< [in,out] Int type fields"]
    pub IntType: ctl_property_info_int_t,
    #[doc = "< [in,out] Enum type fields"]
    pub EnumType: ctl_property_info_enum_t,
    #[doc = "< [in,out] Unsigned Int type fields"]
    pub UIntType: ctl_property_info_uint_t,
}
#[test]
fn bindgen_test_layout__ctl_property_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_info_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_property_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_property_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BoolType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_t),
            "::",
            stringify!(BoolType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FloatType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_t),
            "::",
            stringify!(FloatType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IntType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_t),
            "::",
            stringify!(IntType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnumType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_t),
            "::",
            stringify!(EnumType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UIntType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_info_t),
            "::",
            stringify!(UIntType)
        )
    );
}
#[doc = "\n @brief Feature element details, union of bool/float/enum property_info\n        structs. Used for feature specific capability check"]
pub type ctl_property_info_t = _ctl_property_info_t;
#[doc = "\n @brief Feature element details, union of bool/float/enum property structs.\n        Used for get/set calls"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ctl_property_t {
    #[doc = "< [in,out] Boolean type fields"]
    pub BoolType: ctl_property_boolean_t,
    #[doc = "< [in,out] Float type fields"]
    pub FloatType: ctl_property_float_t,
    #[doc = "< [in,out] Int type fields"]
    pub IntType: ctl_property_int_t,
    #[doc = "< [in,out] Enum type fields"]
    pub EnumType: ctl_property_enum_t,
    #[doc = "< [in,out] Unsigned Int type fields"]
    pub UIntType: ctl_property_uint_t,
}
#[test]
fn bindgen_test_layout__ctl_property_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_property_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_property_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_property_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_property_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_property_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BoolType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_t),
            "::",
            stringify!(BoolType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FloatType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_t),
            "::",
            stringify!(FloatType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IntType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_t),
            "::",
            stringify!(IntType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnumType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_t),
            "::",
            stringify!(EnumType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UIntType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_property_t),
            "::",
            stringify!(UIntType)
        )
    );
}
#[doc = "\n @brief Feature element details, union of bool/float/enum property structs.\n        Used for get/set calls"]
pub type ctl_property_t = _ctl_property_t;
#[doc = "< success"]
pub const _ctl_result_t_CTL_RESULT_SUCCESS: _ctl_result_t = 0;
#[doc = "< success but still open by another caller"]
pub const _ctl_result_t_CTL_RESULT_SUCCESS_STILL_OPEN_BY_ANOTHER_CALLER: _ctl_result_t = 1;
#[doc = "< \"Success group error code end value, not to be used\n< \""]
pub const _ctl_result_t_CTL_RESULT_ERROR_SUCCESS_END: _ctl_result_t = 65535;
#[doc = "< Generic error code starting value, not to be used"]
pub const _ctl_result_t_CTL_RESULT_ERROR_GENERIC_START: _ctl_result_t = 1073741824;
#[doc = "< Result not initialized"]
pub const _ctl_result_t_CTL_RESULT_ERROR_NOT_INITIALIZED: _ctl_result_t = 1073741825;
#[doc = "< Already initialized"]
pub const _ctl_result_t_CTL_RESULT_ERROR_ALREADY_INITIALIZED: _ctl_result_t = 1073741826;
#[doc = "< Device hung, reset, was removed, or driver update occurred"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DEVICE_LOST: _ctl_result_t = 1073741827;
#[doc = "< Insufficient host memory to satisfy call"]
pub const _ctl_result_t_CTL_RESULT_ERROR_OUT_OF_HOST_MEMORY: _ctl_result_t = 1073741828;
#[doc = "< Insufficient device memory to satisfy call"]
pub const _ctl_result_t_CTL_RESULT_ERROR_OUT_OF_DEVICE_MEMORY: _ctl_result_t = 1073741829;
#[doc = "< Access denied due to permission level"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INSUFFICIENT_PERMISSIONS: _ctl_result_t = 1073741830;
#[doc = "< Resource was removed"]
pub const _ctl_result_t_CTL_RESULT_ERROR_NOT_AVAILABLE: _ctl_result_t = 1073741831;
#[doc = "< Library not initialized"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNINITIALIZED: _ctl_result_t = 1073741832;
#[doc = "< Generic error code for unsupported versions"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNSUPPORTED_VERSION: _ctl_result_t = 1073741833;
#[doc = "< Generic error code for unsupported features"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNSUPPORTED_FEATURE: _ctl_result_t = 1073741834;
#[doc = "< Generic error code for invalid arguments"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_ARGUMENT: _ctl_result_t = 1073741835;
#[doc = "< API handle in invalid"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_API_HANDLE: _ctl_result_t = 1073741836;
#[doc = "< Handle argument is not valid"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_NULL_HANDLE: _ctl_result_t = 1073741837;
#[doc = "< Pointer argument may not be nullptr"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_NULL_POINTER: _ctl_result_t = 1073741838;
#[doc = "< Size argument is invalid (e.g., must not be zero)"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_SIZE: _ctl_result_t = 1073741839;
#[doc = "< Size argument is not supported by the device (e.g., too large)"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNSUPPORTED_SIZE: _ctl_result_t = 1073741840;
#[doc = "< Image format is not supported by the device"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNSUPPORTED_IMAGE_FORMAT: _ctl_result_t = 1073741841;
#[doc = "< Data read error"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DATA_READ: _ctl_result_t = 1073741842;
#[doc = "< Data write error"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DATA_WRITE: _ctl_result_t = 1073741843;
#[doc = "< Data not found error"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DATA_NOT_FOUND: _ctl_result_t = 1073741844;
#[doc = "< Function not implemented"]
pub const _ctl_result_t_CTL_RESULT_ERROR_NOT_IMPLEMENTED: _ctl_result_t = 1073741845;
#[doc = "< Operating system call failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_OS_CALL: _ctl_result_t = 1073741846;
#[doc = "< Kernel mode driver call failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_KMD_CALL: _ctl_result_t = 1073741847;
#[doc = "< Library unload failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNLOAD: _ctl_result_t = 1073741848;
#[doc = "< Level0 loader not found"]
pub const _ctl_result_t_CTL_RESULT_ERROR_ZE_LOADER: _ctl_result_t = 1073741849;
#[doc = "< Invalid operation type"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_OPERATION_TYPE: _ctl_result_t = 1073741850;
#[doc = "< Null OS interface"]
pub const _ctl_result_t_CTL_RESULT_ERROR_NULL_OS_INTERFACE: _ctl_result_t = 1073741851;
#[doc = "< Null OS adapter handle"]
pub const _ctl_result_t_CTL_RESULT_ERROR_NULL_OS_ADAPATER_HANDLE: _ctl_result_t = 1073741852;
#[doc = "< Null display output handle"]
pub const _ctl_result_t_CTL_RESULT_ERROR_NULL_OS_DISPLAY_OUTPUT_HANDLE: _ctl_result_t = 1073741853;
#[doc = "< Timeout in Wait function"]
pub const _ctl_result_t_CTL_RESULT_ERROR_WAIT_TIMEOUT: _ctl_result_t = 1073741854;
#[doc = "< Persistance not supported"]
pub const _ctl_result_t_CTL_RESULT_ERROR_PERSISTANCE_NOT_SUPPORTED: _ctl_result_t = 1073741855;
#[doc = "< Platform not supported"]
pub const _ctl_result_t_CTL_RESULT_ERROR_PLATFORM_NOT_SUPPORTED: _ctl_result_t = 1073741856;
#[doc = "< Unknown Appplicaion UID in Initialization call"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNKNOWN_APPLICATION_UID: _ctl_result_t = 1073741857;
#[doc = "< The enum is not valid"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_ENUMERATION: _ctl_result_t = 1073741858;
#[doc = "< Error in file delete operation"]
pub const _ctl_result_t_CTL_RESULT_ERROR_FILE_DELETE: _ctl_result_t = 1073741859;
#[doc = "< The device requires a reset."]
pub const _ctl_result_t_CTL_RESULT_ERROR_RESET_DEVICE_REQUIRED: _ctl_result_t = 1073741860;
#[doc = "< The device requires a full reboot."]
pub const _ctl_result_t_CTL_RESULT_ERROR_FULL_REBOOT_REQUIRED: _ctl_result_t = 1073741861;
#[doc = "< Library load failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_LOAD: _ctl_result_t = 1073741862;
#[doc = "< Unknown or internal error"]
pub const _ctl_result_t_CTL_RESULT_ERROR_UNKNOWN: _ctl_result_t = 1073807359;
#[doc = "< Operation failed, retry previous operation again"]
pub const _ctl_result_t_CTL_RESULT_ERROR_RETRY_OPERATION: _ctl_result_t = 1073807360;
#[doc = "< \"Generic error code end value, not to be used\n< \""]
pub const _ctl_result_t_CTL_RESULT_ERROR_GENERIC_END: _ctl_result_t = 1073807359;
#[doc = "< Core error code starting value, not to be used"]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_START: _ctl_result_t = 1140850688;
#[doc = "< The Overclock is not supported."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_NOT_SUPPORTED: _ctl_result_t = 1140850689;
#[doc = "< The Voltage exceeds the acceptable min/max."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_VOLTAGE_OUTSIDE_RANGE: _ctl_result_t =
    1140850690;
#[doc = "< The Frequency exceeds the acceptable min/max."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_FREQUENCY_OUTSIDE_RANGE: _ctl_result_t =
    1140850691;
#[doc = "< The Power exceeds the acceptable min/max."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_POWER_OUTSIDE_RANGE: _ctl_result_t =
    1140850692;
#[doc = "< The Power exceeds the acceptable min/max."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_TEMPERATURE_OUTSIDE_RANGE: _ctl_result_t =
    1140850693;
#[doc = "< The Overclock is in voltage locked mode."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_IN_VOLTAGE_LOCKED_MODE: _ctl_result_t =
    1140850694;
#[doc = "< It indicates that the requested change will not be applied until the\n< device is reset."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_RESET_REQUIRED: _ctl_result_t = 1140850695;
#[doc = "< The $OverclockWaiverSet function has not been called."]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_OVERCLOCK_WAIVER_NOT_SET: _ctl_result_t = 1140850696;
#[doc = "< \"Core error code end value, not to be used\n< \""]
pub const _ctl_result_t_CTL_RESULT_ERROR_CORE_END: _ctl_result_t = 71368703;
#[doc = "< 3D error code starting value, not to be used"]
pub const _ctl_result_t_CTL_RESULT_ERROR_3D_START: _ctl_result_t = 1610612736;
#[doc = "< \"3D error code end value, not to be used\n< \""]
pub const _ctl_result_t_CTL_RESULT_ERROR_3D_END: _ctl_result_t = 1610678271;
#[doc = "< Media error code starting value, not to be used"]
pub const _ctl_result_t_CTL_RESULT_ERROR_MEDIA_START: _ctl_result_t = 1342177280;
#[doc = "< \"Media error code end value, not to be used\n< \""]
pub const _ctl_result_t_CTL_RESULT_ERROR_MEDIA_END: _ctl_result_t = 1342242815;
#[doc = "< Display error code starting value, not to be used"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DISPLAY_START: _ctl_result_t = 1207959552;
#[doc = "< Invalid flag for Aux access"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_AUX_ACCESS_FLAG: _ctl_result_t = 1207959553;
#[doc = "< Invalid flag for Sharpness"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_SHARPNESS_FILTER_FLAG: _ctl_result_t = 1207959554;
#[doc = "< Error for Display not attached"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DISPLAY_NOT_ATTACHED: _ctl_result_t = 1207959555;
#[doc = "< Error for display attached but not active"]
pub const _ctl_result_t_CTL_RESULT_ERROR_DISPLAY_NOT_ACTIVE: _ctl_result_t = 1207959556;
#[doc = "< Error for invalid power optimization flag"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_POWERFEATURE_OPTIMIZATION_FLAG: _ctl_result_t =
    1207959557;
#[doc = "< DPST is supported only in DC Mode"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_POWERSOURCE_TYPE_FOR_DPST: _ctl_result_t =
    1207959558;
#[doc = "< Invalid query type for pixel transformation get configuration"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_PIXTX_GET_CONFIG_QUERY_TYPE: _ctl_result_t =
    1207959559;
#[doc = "< Invalid operation type for pixel transformation set configuration"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_PIXTX_SET_CONFIG_OPERATION_TYPE: _ctl_result_t =
    1207959560;
#[doc = "< Invalid number of samples for pixel transformation set configuration"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_SET_CONFIG_NUMBER_OF_SAMPLES: _ctl_result_t =
    1207959561;
#[doc = "< Invalid block id for pixel transformation"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_PIXTX_BLOCK_ID: _ctl_result_t = 1207959562;
#[doc = "< Invalid block type for pixel transformation"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_PIXTX_BLOCK_TYPE: _ctl_result_t = 1207959563;
#[doc = "< Invalid block number for pixel transformation"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INVALID_PIXTX_BLOCK_NUMBER: _ctl_result_t = 1207959564;
#[doc = "< Insufficient memery allocated for BlockConfigs"]
pub const _ctl_result_t_CTL_RESULT_ERROR_INSUFFICIENT_PIXTX_BLOCK_CONFIG_MEMORY: _ctl_result_t =
    1207959565;
#[doc = "< Invalid pipe for 3dlut"]
pub const _ctl_result_t_CTL_RESULT_ERROR_3DLUT_INVALID_PIPE: _ctl_result_t = 1207959566;
#[doc = "< Invalid 3dlut data"]
pub const _ctl_result_t_CTL_RESULT_ERROR_3DLUT_INVALID_DATA: _ctl_result_t = 1207959567;
#[doc = "< 3dlut not supported in HDR"]
pub const _ctl_result_t_CTL_RESULT_ERROR_3DLUT_NOT_SUPPORTED_IN_HDR: _ctl_result_t = 1207959568;
#[doc = "< Invalid 3dlut operation"]
pub const _ctl_result_t_CTL_RESULT_ERROR_3DLUT_INVALID_OPERATION: _ctl_result_t = 1207959569;
#[doc = "< 3dlut call unsuccessful"]
pub const _ctl_result_t_CTL_RESULT_ERROR_3DLUT_UNSUCCESSFUL: _ctl_result_t = 1207959570;
#[doc = "< AUX defer failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_AUX_DEFER: _ctl_result_t = 1207959571;
#[doc = "< AUX timeout failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_AUX_TIMEOUT: _ctl_result_t = 1207959572;
#[doc = "< AUX incomplete write failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_AUX_INCOMPLETE_WRITE: _ctl_result_t = 1207959573;
#[doc = "< I2C/AUX unkonown failure"]
pub const _ctl_result_t_CTL_RESULT_ERROR_I2C_AUX_STATUS_UNKNOWN: _ctl_result_t = 1207959574;
#[doc = "< I2C/AUX unsuccessful"]
pub const _ctl_result_t_CTL_RESULT_ERROR_I2C_AUX_UNSUCCESSFUL: _ctl_result_t = 1207959575;
#[doc = "< Lace Incorrrect AggressivePercent data or LuxVsAggressive Map data\n< passed by user"]
pub const _ctl_result_t_CTL_RESULT_ERROR_LACE_INVALID_DATA_ARGUMENT_PASSED: _ctl_result_t =
    1207959576;
#[doc = "< External Display is Attached hence fail the Display Switch"]
pub const _ctl_result_t_CTL_RESULT_ERROR_EXTERNAL_DISPLAY_ATTACHED: _ctl_result_t = 1207959577;
#[doc = "< Standard custom mode exists"]
pub const _ctl_result_t_CTL_RESULT_ERROR_CUSTOM_MODE_STANDARD_CUSTOM_MODE_EXISTS: _ctl_result_t =
    1207959578;
#[doc = "< Non custom matching mode exists"]
pub const _ctl_result_t_CTL_RESULT_ERROR_CUSTOM_MODE_NON_CUSTOM_MATCHING_MODE_EXISTS:
    _ctl_result_t = 1207959579;
#[doc = "< Custom mode insufficent memory"]
pub const _ctl_result_t_CTL_RESULT_ERROR_CUSTOM_MODE_INSUFFICIENT_MEMORY: _ctl_result_t =
    1207959580;
#[doc = "< \"Display error code end value, not to be used\n< \""]
pub const _ctl_result_t_CTL_RESULT_ERROR_DISPLAY_END: _ctl_result_t = 1208025087;
pub const _ctl_result_t_CTL_RESULT_MAX: _ctl_result_t = 1208025088;
#[doc = "\n @brief Defines Return/Error codes.\n        All generic error (bit30) codes are between 0x40000000-0x4000FFFF.\n        All 3D (bit 29) specific error codes are between 0x60000000-0x6000FFFF.\n        All media (bit 28) specific error codes are between 0x50000000-0x5000FFFF.\n        All display (bit 27) specific error codes are between 0x48000000-0x4800FFFF\n        All core (bit 26) specific error codes are between 0x44000000-0x4400FFFF\n        Success result code with additional info are between 0x00000001-0x0000FFFF."]
pub type _ctl_result_t = ::std::os::raw::c_int;
#[doc = "\n @brief Defines Return/Error codes.\n        All generic error (bit30) codes are between 0x40000000-0x4000FFFF.\n        All 3D (bit 29) specific error codes are between 0x60000000-0x6000FFFF.\n        All media (bit 28) specific error codes are between 0x50000000-0x5000FFFF.\n        All display (bit 27) specific error codes are between 0x48000000-0x4800FFFF\n        All core (bit 26) specific error codes are between 0x44000000-0x4400FFFF\n        Success result code with additional info are between 0x00000001-0x0000FFFF."]
pub use self::_ctl_result_t as ctl_result_t;
#[doc = "< Type is Frequency with units in MHz."]
pub const _ctl_units_t_CTL_UNITS_FREQUENCY_MHZ: _ctl_units_t = 0;
#[doc = "< Type is Frequency with units in GT/s (gigatransfers per second)."]
pub const _ctl_units_t_CTL_UNITS_OPERATIONS_GTS: _ctl_units_t = 1;
#[doc = "< Type is Frequency with units in MT/s (megatransfers per second)."]
pub const _ctl_units_t_CTL_UNITS_OPERATIONS_MTS: _ctl_units_t = 2;
#[doc = "< Type is Voltage with units in Volts."]
pub const _ctl_units_t_CTL_UNITS_VOLTAGE_VOLTS: _ctl_units_t = 3;
#[doc = "< Type is Power with units in Watts."]
pub const _ctl_units_t_CTL_UNITS_POWER_WATTS: _ctl_units_t = 4;
#[doc = "< Type is Temperature with units in Celsius."]
pub const _ctl_units_t_CTL_UNITS_TEMPERATURE_CELSIUS: _ctl_units_t = 5;
#[doc = "< Type is Energy with units in Joules."]
pub const _ctl_units_t_CTL_UNITS_ENERGY_JOULES: _ctl_units_t = 6;
#[doc = "< Type is Time with units in Seconds."]
pub const _ctl_units_t_CTL_UNITS_TIME_SECONDS: _ctl_units_t = 7;
#[doc = "< Type is Memory with units in Bytes."]
pub const _ctl_units_t_CTL_UNITS_MEMORY_BYTES: _ctl_units_t = 8;
#[doc = "< Type is Angular Speed with units in Revolutions per Minute."]
pub const _ctl_units_t_CTL_UNITS_ANGULAR_SPEED_RPM: _ctl_units_t = 9;
#[doc = "< Type of units unknown."]
pub const _ctl_units_t_CTL_UNITS_UNKNOWN: _ctl_units_t = 1208025087;
pub const _ctl_units_t_CTL_UNITS_MAX: _ctl_units_t = 1208025088;
#[doc = "\n @brief General Physical Units."]
pub type _ctl_units_t = ::std::os::raw::c_int;
#[doc = "\n @brief General Physical Units."]
pub use self::_ctl_units_t as ctl_units_t;
#[doc = "< The data type is 8 bit signed integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_INT8: _ctl_data_type_t = 0;
#[doc = "< The data type is 8 bit unsigned integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_UINT8: _ctl_data_type_t = 1;
#[doc = "< The data type is 16 bit signed integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_INT16: _ctl_data_type_t = 2;
#[doc = "< The data type is 16 bit unsigned integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_UINT16: _ctl_data_type_t = 3;
#[doc = "< The data type is 32 bit signed integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_INT32: _ctl_data_type_t = 4;
#[doc = "< The data type is 32 bit unsigned integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_UINT32: _ctl_data_type_t = 5;
#[doc = "< The data type is 64 bit signed integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_INT64: _ctl_data_type_t = 6;
#[doc = "< The data type is 64 bit unsigned integer."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_UINT64: _ctl_data_type_t = 7;
#[doc = "< The data type is 32 bit floating point."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_FLOAT: _ctl_data_type_t = 8;
#[doc = "< The data type is 64 bit floating point."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_DOUBLE: _ctl_data_type_t = 9;
#[doc = "< The data type is an array of 8 bit unsigned integers."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_STRING_ASCII: _ctl_data_type_t = 10;
#[doc = "< The data type is an array of 16 bit unsigned integers."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_STRING_UTF16: _ctl_data_type_t = 11;
#[doc = "< The data type is an array of 32 bit unsigned integers."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_STRING_UTF132: _ctl_data_type_t = 12;
#[doc = "< The data type is unknown."]
pub const _ctl_data_type_t_CTL_DATA_TYPE_UNKNOWN: _ctl_data_type_t = 1208025087;
pub const _ctl_data_type_t_CTL_DATA_TYPE_MAX: _ctl_data_type_t = 1208025088;
#[doc = "\n @brief General Data Types."]
pub type _ctl_data_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief General Data Types."]
pub use self::_ctl_data_type_t as ctl_data_type_t;
#[doc = "\n @brief Union for Generic Data.\n\n @details\n     - The telemetry data items could be of different types.\n     - Refer to ::ctl_data_type_t to find the current type."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ctl_data_value_t {
    #[doc = "< [out] The data type is 8 bit signed integer."]
    pub data8: i8,
    #[doc = "< [out] The data type is 8 bit unsigned integer."]
    pub datau8: u8,
    #[doc = "< [out] The data type is 16 bit signed integer."]
    pub data16: i16,
    #[doc = "< [out] The data type is 16 bit unsigned integer."]
    pub datau16: u16,
    #[doc = "< [out] The data type is 32 bit signed integer."]
    pub data32: i32,
    #[doc = "< [out] The data type is 32 bit unsigned integer."]
    pub datau32: u32,
    #[doc = "< [out] The data type is 64 bit signed integer."]
    pub data64: i64,
    #[doc = "< [out] The data type is 64 bit unsigned integer."]
    pub datau64: u64,
    #[doc = "< [out] The data type is 32 bit floating point."]
    pub datafloat: f32,
    #[doc = "< [out] The data type is 64 bit floating point."]
    pub datadouble: f64,
}
#[test]
fn bindgen_test_layout__ctl_data_value_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_data_value_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_data_value_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_data_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_data_value_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_data_value_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(data8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datau8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(datau8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(data16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datau16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(datau16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(data32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datau32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(datau32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(data64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datau64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(datau64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datafloat) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(datafloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datadouble) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_data_value_t),
            "::",
            stringify!(datadouble)
        )
    );
}
#[doc = "\n @brief Union for Generic Data.\n\n @details\n     - The telemetry data items could be of different types.\n     - Refer to ::ctl_data_type_t to find the current type."]
pub type ctl_data_value_t = _ctl_data_value_t;
#[doc = "\n @brief Base for all properties types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_base_properties_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
}
#[test]
fn bindgen_test_layout__ctl_base_properties_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_base_properties_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_base_properties_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_base_properties_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_base_properties_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_base_properties_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_base_properties_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_base_properties_t),
            "::",
            stringify!(Version)
        )
    );
}
#[doc = "\n @brief Base for all properties types"]
pub type ctl_base_properties_t = _ctl_base_properties_t;
#[doc = "\n @brief Application Unique ID"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_application_id_t {
    #[doc = "< [in] Data1"]
    pub Data1: u32,
    #[doc = "< [in] Data2"]
    pub Data2: u16,
    #[doc = "< [in] Data3"]
    pub Data3: u16,
    #[doc = "< [in] Data4"]
    pub Data4: [u8; 8usize],
}
#[test]
fn bindgen_test_layout__ctl_application_id_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_application_id_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_application_id_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_application_id_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_application_id_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_application_id_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_application_id_t),
            "::",
            stringify!(Data1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_application_id_t),
            "::",
            stringify!(Data2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_application_id_t),
            "::",
            stringify!(Data3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data4) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_application_id_t),
            "::",
            stringify!(Data4)
        )
    );
}
#[doc = "\n @brief Application Unique ID"]
pub type ctl_application_id_t = _ctl_application_id_t;
#[doc = "\n @brief Init arguments"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_init_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in][release] App's IGCL version"]
    pub AppVersion: ctl_version_info_t,
    #[doc = "< [in][release] Caller version"]
    pub flags: ctl_init_flags_t,
    #[doc = "< [out][release] IGCL implementation version"]
    pub SupportedVersion: ctl_version_info_t,
    #[doc = "< [in] Application Provided Unique ID.Application can pass all 0's as\n< the default ID"]
    pub ApplicationUID: ctl_application_id_t,
}
#[test]
fn bindgen_test_layout__ctl_init_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_init_args_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_init_args_t>(),
        36usize,
        concat!("Size of: ", stringify!(_ctl_init_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_init_args_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_init_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_init_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_init_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AppVersion) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_init_args_t),
            "::",
            stringify!(AppVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_init_args_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedVersion) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_init_args_t),
            "::",
            stringify!(SupportedVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationUID) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_init_args_t),
            "::",
            stringify!(ApplicationUID)
        )
    );
}
#[doc = "\n @brief Init arguments"]
pub type ctl_init_args_t = _ctl_init_args_t;
#[doc = "\n @brief Reserved struct"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_reserved_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Reserved struct"]
    pub pSpecialArg: *mut ::std::os::raw::c_void,
    #[doc = "< [in] struct size"]
    pub ArgSize: u32,
}
#[test]
fn bindgen_test_layout__ctl_reserved_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_reserved_args_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_reserved_args_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_reserved_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_reserved_args_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_reserved_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_reserved_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_reserved_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pSpecialArg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_reserved_args_t),
            "::",
            stringify!(pSpecialArg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ArgSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_reserved_args_t),
            "::",
            stringify!(ArgSize)
        )
    );
}
#[doc = "\n @brief Reserved struct"]
pub type ctl_reserved_args_t = _ctl_reserved_args_t;
#[doc = "\n @brief Reserved base struct"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_reserved_args_base_t {
    #[doc = "< [in] Unique ID for reserved/special function"]
    pub ReservedFuncID: ctl_application_id_t,
}
#[test]
fn bindgen_test_layout__ctl_reserved_args_base_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_reserved_args_base_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_reserved_args_base_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_reserved_args_base_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_reserved_args_base_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_reserved_args_base_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFuncID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_reserved_args_base_t),
            "::",
            stringify!(ReservedFuncID)
        )
    );
}
#[doc = "\n @brief Reserved base struct"]
pub type ctl_reserved_args_base_t = _ctl_reserved_args_base_t;
#[doc = "\n @brief Reserved - Unlock function capability"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_unlock_capability_t {
    #[doc = "< [in] Unique ID for reserved/special function"]
    pub ReservedFuncID: ctl_application_id_t,
    #[doc = "< [in] Unique ID to unlock a specific function"]
    pub UnlockCapsID: ctl_application_id_t,
}
#[test]
fn bindgen_test_layout__ctl_unlock_capability_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_unlock_capability_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_unlock_capability_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_unlock_capability_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_unlock_capability_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_unlock_capability_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFuncID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_unlock_capability_t),
            "::",
            stringify!(ReservedFuncID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UnlockCapsID) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_unlock_capability_t),
            "::",
            stringify!(UnlockCapsID)
        )
    );
}
#[doc = "\n @brief Reserved - Unlock function capability"]
pub type ctl_unlock_capability_t = _ctl_unlock_capability_t;
#[doc = "\n @brief Used by loader like modules to specify runtime implementation details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_runtime_path_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Unique ID for reserved/special function"]
    pub UnlockID: ctl_application_id_t,
    #[doc = "< [in] Path to runtime DLL"]
    pub pRuntimePath: *mut wchar_t,
    #[doc = "< [in] Device ID of interest to caller. pRuntimePath should not be NULL."]
    pub DeviceID: u16,
    #[doc = "< [in] Revision ID of interest to caller. pRuntimePath should not be\n< NULL."]
    pub RevID: u8,
}
#[test]
fn bindgen_test_layout__ctl_runtime_path_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_runtime_path_args_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_runtime_path_args_t>(),
        40usize,
        concat!("Size of: ", stringify!(_ctl_runtime_path_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_runtime_path_args_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_runtime_path_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_runtime_path_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_runtime_path_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UnlockID) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_runtime_path_args_t),
            "::",
            stringify!(UnlockID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pRuntimePath) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_runtime_path_args_t),
            "::",
            stringify!(pRuntimePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeviceID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_runtime_path_args_t),
            "::",
            stringify!(DeviceID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RevID) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_runtime_path_args_t),
            "::",
            stringify!(RevID)
        )
    );
}
#[doc = "\n @brief Used by loader like modules to specify runtime implementation details"]
pub type ctl_runtime_path_args_t = _ctl_runtime_path_args_t;
extern "C" {
    #[doc = "\n @brief Control Api Init\n\n @details\n     - Control Api Init\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pInitDesc`\n         + `nullptr == phAPIHandle`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlInit(
        pInitDesc: *mut ctl_init_args_t,
        phAPIHandle: *mut ctl_api_handle_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Control Api Destroy\n\n @details\n     - Control Api Close\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hAPIHandle`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlClose(hAPIHandle: ctl_api_handle_t) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Runtime path\n\n @details\n     - Control Api set runtime path. Optional call from a loader which allows\n       the loaded runtime to enumerate only the adapters which the specified\n       runtime is responsible for. This is done usually by a loader or by\n       callers who know how to get the specific runtime of interest. This\n       call right now is reserved for use by Intel components.\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlSetRuntimePath(pArgs: *mut ctl_runtime_path_args_t) -> ctl_result_t;
}
#[doc = "\n @brief Supported Functions"]
pub type ctl_supported_functions_flags_t = u32;
#[doc = "< [out] Is Display supported"]
pub const _ctl_supported_functions_flag_t_CTL_SUPPORTED_FUNCTIONS_FLAG_DISPLAY:
    _ctl_supported_functions_flag_t = 1;
#[doc = "< [out] Is 3D supported"]
pub const _ctl_supported_functions_flag_t_CTL_SUPPORTED_FUNCTIONS_FLAG_3D:
    _ctl_supported_functions_flag_t = 2;
#[doc = "< [out] Is Media supported"]
pub const _ctl_supported_functions_flag_t_CTL_SUPPORTED_FUNCTIONS_FLAG_MEDIA:
    _ctl_supported_functions_flag_t = 4;
pub const _ctl_supported_functions_flag_t_CTL_SUPPORTED_FUNCTIONS_FLAG_MAX:
    _ctl_supported_functions_flag_t = -2147483648;
pub type _ctl_supported_functions_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_supported_functions_flag_t as ctl_supported_functions_flag_t;
#[doc = "\n @brief Firmware version"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_firmware_version_t {
    #[doc = "< [out] Major version"]
    pub major_version: u64,
    #[doc = "< [out] Minor version"]
    pub minor_version: u64,
    #[doc = "< [out] Build number"]
    pub build_number: u64,
}
#[test]
fn bindgen_test_layout__ctl_firmware_version_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_firmware_version_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_firmware_version_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_firmware_version_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_firmware_version_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_firmware_version_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_firmware_version_t),
            "::",
            stringify!(major_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor_version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_firmware_version_t),
            "::",
            stringify!(minor_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).build_number) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_firmware_version_t),
            "::",
            stringify!(build_number)
        )
    );
}
#[doc = "\n @brief Firmware version"]
pub type ctl_firmware_version_t = _ctl_firmware_version_t;
#[doc = "< Graphics Device type"]
pub const _ctl_device_type_t_CTL_DEVICE_TYPE_GRAPHICS: _ctl_device_type_t = 1;
#[doc = "< System Device type"]
pub const _ctl_device_type_t_CTL_DEVICE_TYPE_SYSTEM: _ctl_device_type_t = 2;
pub const _ctl_device_type_t_CTL_DEVICE_TYPE_MAX: _ctl_device_type_t = 3;
#[doc = "\n @brief DeviceType"]
pub type _ctl_device_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief DeviceType"]
pub use self::_ctl_device_type_t as ctl_device_type_t;
#[doc = "\n @brief Adapter Properties"]
pub type ctl_adapter_properties_flags_t = u32;
#[doc = "< [out] Is Integrated Graphics adapter"]
pub const _ctl_adapter_properties_flag_t_CTL_ADAPTER_PROPERTIES_FLAG_INTEGRATED:
    _ctl_adapter_properties_flag_t = 1;
pub const _ctl_adapter_properties_flag_t_CTL_ADAPTER_PROPERTIES_FLAG_MAX:
    _ctl_adapter_properties_flag_t = -2147483648;
pub type _ctl_adapter_properties_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_adapter_properties_flag_t as ctl_adapter_properties_flag_t;
#[doc = "\n @brief Device Adapter properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_device_adapter_properties_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] OS specific Device ID"]
    pub pDeviceID: *mut ::std::os::raw::c_void,
    #[doc = "< [in] size of the device ID"]
    pub device_id_size: u32,
    #[doc = "< [out] Device Type"]
    pub device_type: ctl_device_type_t,
    #[doc = "< [out] Supported functions"]
    pub supported_subfunction_flags: ctl_supported_functions_flags_t,
    #[doc = "< [out] Driver version"]
    pub driver_version: u64,
    #[doc = "< [out] Firmware version"]
    pub firmware_version: ctl_firmware_version_t,
    #[doc = "< [out] PCI Vendor ID"]
    pub pci_vendor_id: u32,
    #[doc = "< [out] PCI Device ID"]
    pub pci_device_id: u32,
    #[doc = "< [out] PCI Revision ID"]
    pub rev_id: u32,
    #[doc = "< [out] Number of EUs per sub-slice"]
    pub num_eus_per_sub_slice: u32,
    #[doc = "< [out] Number of sub-slices per slice"]
    pub num_sub_slices_per_slice: u32,
    #[doc = "< [out] Number of slices"]
    pub num_slices: u32,
    #[doc = "< [out] Device name"]
    pub name: [::std::os::raw::c_char; 100usize],
    #[doc = "< [out] Graphics Adapter Properties"]
    pub graphics_adapter_properties: ctl_adapter_properties_flags_t,
    #[doc = "< [out] Clock frequency for this device. Supported only for Version > 0"]
    pub Frequency: u32,
    #[doc = "< [out] PCI SubSys ID, Supported only for Version > 1"]
    pub pci_subsys_id: u16,
    #[doc = "< [out] PCI SubSys Vendor ID, Supported only for Version > 1"]
    pub pci_subsys_vendor_id: u16,
    #[doc = "< [out] Reserved"]
    pub reserved: [::std::os::raw::c_char; 116usize],
}
#[test]
fn bindgen_test_layout__ctl_device_adapter_properties_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_device_adapter_properties_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_device_adapter_properties_t>(),
        320usize,
        concat!("Size of: ", stringify!(_ctl_device_adapter_properties_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_device_adapter_properties_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_device_adapter_properties_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDeviceID) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(pDeviceID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_id_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(device_id_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_type) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(device_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).supported_subfunction_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(supported_subfunction_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).driver_version) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(driver_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firmware_version) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(firmware_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pci_vendor_id) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(pci_vendor_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pci_device_id) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(pci_device_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rev_id) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(rev_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_eus_per_sub_slice) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(num_eus_per_sub_slice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_sub_slices_per_slice) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(num_sub_slices_per_slice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_slices) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(num_slices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).graphics_adapter_properties) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(graphics_adapter_properties)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Frequency) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(Frequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pci_subsys_id) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(pci_subsys_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pci_subsys_vendor_id) as usize - ptr as usize },
        198usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(pci_subsys_vendor_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_device_adapter_properties_t),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = "\n @brief Device Adapter properties"]
pub type ctl_device_adapter_properties_t = _ctl_device_adapter_properties_t;
#[doc = "< Read operation"]
pub const _ctl_operation_type_t_CTL_OPERATION_TYPE_READ: _ctl_operation_type_t = 1;
#[doc = "< Write operation"]
pub const _ctl_operation_type_t_CTL_OPERATION_TYPE_WRITE: _ctl_operation_type_t = 2;
pub const _ctl_operation_type_t_CTL_OPERATION_TYPE_MAX: _ctl_operation_type_t = 3;
#[doc = "\n @brief OperationType"]
pub type _ctl_operation_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief OperationType"]
pub use self::_ctl_operation_type_t as ctl_operation_type_t;
#[doc = "\n @brief Generic Structure for Void* datatypes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_generic_void_datatype_t {
    #[doc = "< [in,out]void pointer to memory"]
    pub pData: *mut ::std::os::raw::c_void,
    #[doc = "< [in,out]size of the allocated memory"]
    pub size: u32,
}
#[test]
fn bindgen_test_layout__ctl_generic_void_datatype_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_generic_void_datatype_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_generic_void_datatype_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_generic_void_datatype_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_generic_void_datatype_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_generic_void_datatype_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_generic_void_datatype_t),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_generic_void_datatype_t),
            "::",
            stringify!(size)
        )
    );
}
#[doc = "\n @brief Generic Structure for Void* datatypes"]
pub type ctl_generic_void_datatype_t = _ctl_generic_void_datatype_t;
#[doc = "\n @brief Generic Structure for Revision datatypes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_revision_datatype_t {
    #[doc = "< [in,out]Major Version"]
    pub major_version: u8,
    #[doc = "< [in,out]Minor Version"]
    pub minor_version: u8,
    #[doc = "< [in,out]Revision Version"]
    pub revision_version: u8,
}
#[test]
fn bindgen_test_layout__ctl_revision_datatype_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_revision_datatype_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_revision_datatype_t>(),
        3usize,
        concat!("Size of: ", stringify!(_ctl_revision_datatype_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_revision_datatype_t>(),
        1usize,
        concat!("Alignment of ", stringify!(_ctl_revision_datatype_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_revision_datatype_t),
            "::",
            stringify!(major_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor_version) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_revision_datatype_t),
            "::",
            stringify!(minor_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).revision_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_revision_datatype_t),
            "::",
            stringify!(revision_version)
        )
    );
}
#[doc = "\n @brief Generic Structure for Revision datatypes"]
pub type ctl_revision_datatype_t = _ctl_revision_datatype_t;
#[doc = "\n @brief Property Type flags"]
pub type ctl_property_type_flags_t = u32;
#[doc = "< Display type. Supported scenarios: Sharpness/gamma/CSC"]
pub const _ctl_property_type_flag_t_CTL_PROPERTY_TYPE_FLAG_DISPLAY: _ctl_property_type_flag_t = 1;
#[doc = "< 3D type. Supported scenarios: All set calls via IGCL's 3D APIs"]
pub const _ctl_property_type_flag_t_CTL_PROPERTY_TYPE_FLAG_3D: _ctl_property_type_flag_t = 2;
#[doc = "< Media type. Supported scenarios: All set calls via IGCL's media APIs"]
pub const _ctl_property_type_flag_t_CTL_PROPERTY_TYPE_FLAG_MEDIA: _ctl_property_type_flag_t = 4;
#[doc = "< For future: Core graphic event types like clocking, frequency etc."]
pub const _ctl_property_type_flag_t_CTL_PROPERTY_TYPE_FLAG_CORE: _ctl_property_type_flag_t = 8;
pub const _ctl_property_type_flag_t_CTL_PROPERTY_TYPE_FLAG_MAX: _ctl_property_type_flag_t =
    -2147483648;
pub type _ctl_property_type_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_property_type_flag_t as ctl_property_type_flag_t;
#[doc = "\n @brief Arguments related to wait for a property change function"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_wait_property_change_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Type of the property"]
    pub PropertyType: ctl_property_type_flags_t,
    #[doc = "< [in][release] Time-out interval in milliseconds. Specify 0xFFFFFFFF if\n< time-out is not desired"]
    pub TimeOutMilliSec: u32,
    #[doc = "< [in][release] Event flags for future use"]
    pub EventMiscFlags: u32,
    #[doc = "< [in][release] Reserved for future use"]
    pub pReserved: *mut ::std::os::raw::c_void,
    #[doc = "< [out] Reserved out argument for future use"]
    pub ReservedOutFlags: u64,
}
#[test]
fn bindgen_test_layout__ctl_wait_property_change_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_wait_property_change_args_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_wait_property_change_args_t>(),
        40usize,
        concat!("Size of: ", stringify!(_ctl_wait_property_change_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_wait_property_change_args_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_wait_property_change_args_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PropertyType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(PropertyType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeOutMilliSec) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(TimeOutMilliSec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EventMiscFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(EventMiscFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pReserved) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(pReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedOutFlags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_wait_property_change_args_t),
            "::",
            stringify!(ReservedOutFlags)
        )
    );
}
#[doc = "\n @brief Arguments related to wait for a property change function"]
pub type ctl_wait_property_change_args_t = _ctl_wait_property_change_args_t;
#[doc = "< 0 Degree"]
pub const _ctl_display_orientation_t_CTL_DISPLAY_ORIENTATION_0: _ctl_display_orientation_t = 0;
#[doc = "< 90 Degree"]
pub const _ctl_display_orientation_t_CTL_DISPLAY_ORIENTATION_90: _ctl_display_orientation_t = 1;
#[doc = "< 180 Degree"]
pub const _ctl_display_orientation_t_CTL_DISPLAY_ORIENTATION_180: _ctl_display_orientation_t = 2;
#[doc = "< 270 Degree"]
pub const _ctl_display_orientation_t_CTL_DISPLAY_ORIENTATION_270: _ctl_display_orientation_t = 3;
pub const _ctl_display_orientation_t_CTL_DISPLAY_ORIENTATION_MAX: _ctl_display_orientation_t = 4;
#[doc = "\n @brief Display orientation (rotation)"]
pub type _ctl_display_orientation_t = ::std::os::raw::c_int;
#[doc = "\n @brief Display orientation (rotation)"]
pub use self::_ctl_display_orientation_t as ctl_display_orientation_t;
#[doc = "\n @brief Rectangle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_rect_t {
    #[doc = "< [in,out] Left"]
    pub Left: i32,
    #[doc = "< [in,out] Top"]
    pub Top: i32,
    #[doc = "< [in,out] Right"]
    pub Right: i32,
    #[doc = "< [in,out] Bottom"]
    pub Bottom: i32,
}
#[test]
fn bindgen_test_layout__ctl_rect_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_rect_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_rect_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_rect_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_rect_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_rect_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_rect_t),
            "::",
            stringify!(Left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Top) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_rect_t),
            "::",
            stringify!(Top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_rect_t),
            "::",
            stringify!(Right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Bottom) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_rect_t),
            "::",
            stringify!(Bottom)
        )
    );
}
#[doc = "\n @brief Rectangle"]
pub type ctl_rect_t = _ctl_rect_t;
extern "C" {
    #[doc = "\n @brief Wait for a property change. Note that this is a blocking call\n\n @details\n     - Wait for a property change in display, 3d, media etc.\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDeviceAdapter`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlWaitForPropertyChange(
        hDeviceAdapter: ctl_device_adapter_handle_t,
        pArgs: *mut ctl_wait_property_change_args_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Reserved function\n\n @details\n     - Reserved function\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDeviceAdapter`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlReservedCall(
        hDeviceAdapter: ctl_device_adapter_handle_t,
        pArgs: *mut ctl_reserved_args_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief Endurance Gaming caps"]
pub type ctl_endurance_gaming_caps_t = _ctl_endurance_gaming_caps_t;
#[doc = "\n @brief Endurance Gaming Get/Set"]
pub type ctl_endurance_gaming_t = _ctl_endurance_gaming_t;
#[doc = "\n @brief Endurance Gaming version2 Get/Set"]
pub type ctl_endurance_gaming2_t = _ctl_endurance_gaming2_t;
#[doc = "\n @brief Adaptive sync plus caps"]
pub type ctl_adaptivesync_caps_t = _ctl_adaptivesync_caps_t;
#[doc = "\n @brief Adaptive sync plus"]
pub type ctl_adaptivesync_getset_t = _ctl_adaptivesync_getset_t;
#[doc = "\n @brief Game Profile Capabilities. Typically these remain the same across\n        games."]
pub type ctl_3d_app_profiles_caps_t = _ctl_3d_app_profiles_caps_t;
#[doc = "\n @brief Game Profile tiers"]
pub type ctl_3d_app_profiles_t = _ctl_3d_app_profiles_t;
#[doc = "\n @brief Game Profile tiers details"]
pub type ctl_3d_tier_details_t = _ctl_3d_tier_details_t;
#[doc = "\n @brief 3D feature capability details which will have range/supported and\n        default values"]
pub type ctl_3d_feature_details_t = _ctl_3d_feature_details_t;
#[doc = "\n @brief 3D feature which are controllable"]
pub type ctl_3d_feature_caps_t = _ctl_3d_feature_caps_t;
#[doc = "\n @brief 3D feature for get/set"]
pub type ctl_3d_feature_getset_t = _ctl_3d_feature_getset_t;
#[doc = "\n @brief Load KMD gaming features. Restricted function"]
pub type ctl_kmd_load_features_t = _ctl_kmd_load_features_t;
#[doc = "\n @brief Display Timing"]
pub type ctl_display_timing_t = _ctl_display_timing_t;
#[doc = "\n @brief This structure will contain the properties of the display currently\n        attached to the encoder."]
pub type ctl_display_properties_t = _ctl_display_properties_t;
#[doc = "\n @brief Adapter's display encoder properties"]
pub type ctl_adapter_display_encoder_properties_t = _ctl_adapter_display_encoder_properties_t;
#[doc = "\n @brief Sharpness filter properties"]
pub type ctl_sharpness_filter_properties_t = _ctl_sharpness_filter_properties_t;
#[doc = "\n @brief Various sharpness filter types"]
pub type ctl_sharpness_caps_t = _ctl_sharpness_caps_t;
#[doc = "\n @brief Current sharpness setting"]
pub type ctl_sharpness_settings_t = _ctl_sharpness_settings_t;
#[doc = "\n @brief I2C access arguments"]
pub type ctl_i2c_access_args_t = _ctl_i2c_access_args_t;
#[doc = "\n @brief AUX access arguments"]
pub type ctl_aux_access_args_t = _ctl_aux_access_args_t;
#[doc = "\n @brief Power optimization caps"]
pub type ctl_power_optimization_caps_t = _ctl_power_optimization_caps_t;
#[doc = "\n @brief LRR detailed settings"]
pub type ctl_power_optimization_lrr_t = _ctl_power_optimization_lrr_t;
#[doc = "\n @brief PSR detailed settings"]
pub type ctl_power_optimization_psr_t = _ctl_power_optimization_psr_t;
#[doc = "\n @brief DPST detailed settings"]
pub type ctl_power_optimization_dpst_t = _ctl_power_optimization_dpst_t;
#[doc = "\n @brief Power optimization settings"]
pub type ctl_power_optimization_settings_t = _ctl_power_optimization_settings_t;
#[doc = "\n @brief Brightness settings for SET call"]
pub type ctl_set_brightness_t = _ctl_set_brightness_t;
#[doc = "\n @brief Brightness settings for GET call"]
pub type ctl_get_brightness_t = _ctl_get_brightness_t;
#[doc = "\n @brief Pixel transformation color primaries"]
pub type ctl_pixtx_color_primaries_t = _ctl_pixtx_color_primaries_t;
#[doc = "\n @brief Pixel transformation pixel format"]
pub type ctl_pixtx_pixel_format_t = _ctl_pixtx_pixel_format_t;
#[doc = "\n @brief Pixel transformation 1D LUT configuration"]
pub type ctl_pixtx_1dlut_config_t = _ctl_pixtx_1dlut_config_t;
#[doc = "\n @brief Pixel transformation matrix configuration"]
pub type ctl_pixtx_matrix_config_t = _ctl_pixtx_matrix_config_t;
#[doc = "\n @brief Pixel transformation 3D LUT sample. Samples are converted to integer\n        based on underlying HW capabilities. Hence slight precision loss will\n        be observed while getting sample values."]
pub type ctl_pixtx_3dlut_sample_t = _ctl_pixtx_3dlut_sample_t;
#[doc = "\n @brief Pixel transformation 3D LUT configuration"]
pub type ctl_pixtx_3dlut_config_t = _ctl_pixtx_3dlut_config_t;
#[doc = "\n @brief Pixel transformation block configuration"]
pub type ctl_pixtx_block_config_t = _ctl_pixtx_block_config_t;
#[doc = "\n @brief Pixel transformation pipe get configuration"]
pub type ctl_pixtx_pipe_get_config_t = _ctl_pixtx_pipe_get_config_t;
#[doc = "\n @brief Pixel transformation pipe set configuration"]
pub type ctl_pixtx_pipe_set_config_t = _ctl_pixtx_pipe_set_config_t;
#[doc = "\n @brief Panel descriptor access arguments"]
pub type ctl_panel_descriptor_access_args_t = _ctl_panel_descriptor_access_args_t;
#[doc = "\n @brief Set/Get Retro Scaling Type"]
pub type ctl_retro_scaling_settings_t = _ctl_retro_scaling_settings_t;
#[doc = "\n @brief Retro Scaling caps"]
pub type ctl_retro_scaling_caps_t = _ctl_retro_scaling_caps_t;
#[doc = "\n @brief Scaling caps"]
pub type ctl_scaling_caps_t = _ctl_scaling_caps_t;
#[doc = "\n @brief Set/Get Scaling type"]
pub type ctl_scaling_settings_t = _ctl_scaling_settings_t;
#[doc = "\n @brief Ambient light based enhancement table entry"]
pub type ctl_lace_lux_aggr_map_entry_t = _ctl_lace_lux_aggr_map_entry_t;
#[doc = "\n @brief Ambient light based enhancement table"]
pub type ctl_lace_lux_aggr_map_t = _ctl_lace_lux_aggr_map_t;
#[doc = "\n @brief Set/Get LACE Config"]
pub type ctl_lace_config_t = _ctl_lace_config_t;
#[doc = "\n @brief Get Software PSR status/Set Software PSR settings"]
pub type ctl_sw_psr_settings_t = _ctl_sw_psr_settings_t;
#[doc = "\n @brief Intel Arc Sync Monitor Params"]
pub type ctl_intel_arc_sync_monitor_params_t = _ctl_intel_arc_sync_monitor_params_t;
#[doc = "\n @brief Display MUX device properties"]
pub type ctl_mux_properties_t = _ctl_mux_properties_t;
#[doc = "\n @brief Intel Arc Sync Profile Params"]
pub type ctl_intel_arc_sync_profile_params_t = _ctl_intel_arc_sync_profile_params_t;
#[doc = "\n @brief EDID management"]
pub type ctl_edid_management_args_t = _ctl_edid_management_args_t;
#[doc = "\n @brief Get/Set Custom Mode"]
pub type ctl_get_set_custom_mode_args_t = _ctl_get_set_custom_mode_args_t;
#[doc = "\n @brief Get/Set Custom Mode"]
pub type ctl_custom_src_mode_t = _ctl_custom_src_mode_t;
#[doc = "\n @brief Combined Display's child display target mode"]
pub type ctl_child_display_target_mode_t = _ctl_child_display_target_mode_t;
#[doc = "\n @brief Combined Display's child display information"]
pub type ctl_combined_display_child_info_t = _ctl_combined_display_child_info_t;
#[doc = "\n @brief Combined Display arguments"]
pub type ctl_combined_display_args_t = _ctl_combined_display_args_t;
#[doc = "\n @brief Display Genlock Info"]
pub type ctl_genlock_display_info_t = _ctl_genlock_display_info_t;
#[doc = "\n @brief Genlock Target Mode List"]
pub type ctl_genlock_target_mode_list_t = _ctl_genlock_target_mode_list_t;
#[doc = "\n @brief Genlock Topology"]
pub type ctl_genlock_topology_t = _ctl_genlock_topology_t;
#[doc = "\n @brief Display Genlock Arg type"]
pub type ctl_genlock_args_t = _ctl_genlock_args_t;
#[doc = "\n @brief Engine group properties"]
pub type ctl_engine_properties_t = _ctl_engine_properties_t;
#[doc = "\n @brief Engine activity counters\n\n @details\n     - Percent utilization is calculated by taking two snapshots (s1, s2) and\n       using the equation: %util = (s2.activeTime - s1.activeTime) /\n       (s2.timestamp - s1.timestamp)"]
pub type ctl_engine_stats_t = _ctl_engine_stats_t;
#[doc = "\n @brief Fan speed"]
pub type ctl_fan_speed_t = _ctl_fan_speed_t;
#[doc = "\n @brief Fan temperature/speed pair"]
pub type ctl_fan_temp_speed_t = _ctl_fan_temp_speed_t;
#[doc = "\n @brief Fan speed table"]
pub type ctl_fan_speed_table_t = _ctl_fan_speed_table_t;
#[doc = "\n @brief Fan properties"]
pub type ctl_fan_properties_t = _ctl_fan_properties_t;
#[doc = "\n @brief Fan configuration"]
pub type ctl_fan_config_t = _ctl_fan_config_t;
#[doc = "\n @brief Frequency properties"]
pub type ctl_freq_properties_t = _ctl_freq_properties_t;
#[doc = "\n @brief Frequency range between which the hardware can operate. The limits can\n        be above or below the hardware limits - the hardware will clamp\n        appropriately."]
pub type ctl_freq_range_t = _ctl_freq_range_t;
#[doc = "\n @brief Frequency state"]
pub type ctl_freq_state_t = _ctl_freq_state_t;
#[doc = "\n @brief Frequency throttle time snapshot\n\n @details\n     - Percent time throttled is calculated by taking two snapshots (s1, s2)\n       and using the equation: %throttled = (s2.throttleTime -\n       s1.throttleTime) / (s2.timestamp - s1.timestamp)"]
pub type ctl_freq_throttle_time_t = _ctl_freq_throttle_time_t;
#[doc = "\n @brief Super Resolution feature details structure to be used with\n        SUPER_RESOLUTION"]
pub type ctl_video_processing_super_resolution_info_t =
    _ctl_video_processing_super_resolution_info_t;
#[doc = "\n @brief Super Resolution Get/Set structure to be used with SUPER_RESOLUTION"]
pub type ctl_video_processing_super_resolution_t = _ctl_video_processing_super_resolution_t;
#[doc = "\n @brief Noise Reduction feature details structure to be used with\n        NOISE_REDUCTION"]
pub type ctl_video_processing_noise_reduction_info_t = _ctl_video_processing_noise_reduction_info_t;
#[doc = "\n @brief Noise Reduction Get/Set structure to be used with NOISE_REDUCTION"]
pub type ctl_video_processing_noise_reduction_t = _ctl_video_processing_noise_reduction_t;
#[doc = "\n @brief Adaptive Contrast Enhancement feature details structure to be used\n        with ADAPTIVE_CONTRAST_ENHANCEMENT"]
pub type ctl_video_processing_adaptive_contrast_enhancement_info_t =
    _ctl_video_processing_adaptive_contrast_enhancement_info_t;
#[doc = "\n @brief Adaptive Contrast Enhancement Get/Set structure to be used with\n        ADAPTIVE_CONTRAST_ENHANCEMENT"]
pub type ctl_video_processing_adaptive_contrast_enhancement_t =
    _ctl_video_processing_adaptive_contrast_enhancement_t;
#[doc = "\n @brief Standard Color Correction feature details structure to be used with\n        STANDARD_COLOR_CORRECTION"]
pub type ctl_video_processing_standard_color_correction_info_t =
    _ctl_video_processing_standard_color_correction_info_t;
#[doc = "\n @brief Standard Color Correction Get/Set structure to be used with\n        STANDARD_COLOR_CORRECTION"]
pub type ctl_video_processing_standard_color_correction_t =
    _ctl_video_processing_standard_color_correction_t;
#[doc = "\n @brief Total Color Correction Get/Set structure to be used with\n        TOTAL_COLOR_CORRECTION"]
pub type ctl_video_processing_total_color_correction_info_t =
    _ctl_video_processing_total_color_correction_info_t;
#[doc = "\n @brief Total Color Correction Get/Set structure to be used with\n        TOTAL_COLOR_CORRECTION"]
pub type ctl_video_processing_total_color_correction_t =
    _ctl_video_processing_total_color_correction_t;
#[doc = "\n @brief Video Processing feature details which will have range supported and\n        default values"]
pub type ctl_video_processing_feature_details_t = _ctl_video_processing_feature_details_t;
#[doc = "\n @brief Video Processing features which are controllable"]
pub type ctl_video_processing_feature_caps_t = _ctl_video_processing_feature_caps_t;
#[doc = "\n @brief Video Processing feature for get/set"]
pub type ctl_video_processing_feature_getset_t = _ctl_video_processing_feature_getset_t;
#[doc = "\n @brief Memory properties"]
pub type ctl_mem_properties_t = _ctl_mem_properties_t;
#[doc = "\n @brief Memory state - health, allocated\n\n @details\n     - Percent allocation is given by 100 * (size - free / size.\n     - Percent free is given by 100 * free / size."]
pub type ctl_mem_state_t = _ctl_mem_state_t;
#[doc = "\n @brief Memory bandwidth\n\n @details\n     - Percent bandwidth is calculated by taking two snapshots (s1, s2) and\n       using the equation: %bw = 10^6 * ((s2.readCounter - s1.readCounter) +\n       (s2.writeCounter - s1.writeCounter)) / (s2.maxBandwidth *\n       (s2.timestamp - s1.timestamp))"]
pub type ctl_mem_bandwidth_t = _ctl_mem_bandwidth_t;
#[doc = "\n @brief Telemetry Item for each telemetry property\n\n @details\n     - If the supported field is true, then the entire structure has valid\n       information.\n     - The ::ctl_data_value_t is of type ::ctl_data_type_t and units\n       ::ctl_units_t"]
pub type ctl_oc_telemetry_item_t = _ctl_oc_telemetry_item_t;
#[doc = "\n @brief Overclocking Control Information\n\n @details\n     - Whether the device supports overclocking.\n     - The\n       bSupported/bRelative/bReference/units/min/max/step/default/reference\n       values for the available overclock controls\n     - The idea is to facilitate the way the applications present overclock\n       settings to the user. If bSupported is false, the corresponding\n       overclock control is not supported\n     - The setting units will be an enum that enables the application to know\n       the units for the control setting e.g. MHz. The min and max settings\n       give the limits for the control.\n     - The step setting gives the minimum change in the control value (plus\n       or minus) - if a control is not changed by at least this amount, the\n       hardware may round up or down.\n     - The default values gives the manufacturing setting for the control.\n       Some controls such as frequency offset and voltage offset are\n       relative; in this case, bRelative will be true, otherwise the control\n       settings are absolute values.\n     - For relative controls and if bReference is true, the reference value\n       gives the absolute value at the default setting.\n     - If bReference is false, the absolute value of the default setting is\n       no not known and it is probably better to display the setting to users\n       as percentage offsets."]
pub type ctl_oc_control_info_t = _ctl_oc_control_info_t;
#[doc = "\n @brief Overclock properties"]
pub type ctl_oc_properties_t = _ctl_oc_properties_t;
#[doc = "\n @brief Overclock Voltage Frequency Pair"]
pub type ctl_oc_vf_pair_t = _ctl_oc_vf_pair_t;
#[doc = "\n @brief PSU Info"]
pub type ctl_psu_info_t = _ctl_psu_info_t;
#[doc = "\n @brief Power Telemetry"]
pub type ctl_power_telemetry_t = _ctl_power_telemetry_t;
#[doc = "\n @brief PCI address"]
pub type ctl_pci_address_t = _ctl_pci_address_t;
#[doc = "\n @brief PCI speed"]
pub type ctl_pci_speed_t = _ctl_pci_speed_t;
#[doc = "\n @brief Static PCI properties"]
pub type ctl_pci_properties_t = _ctl_pci_properties_t;
#[doc = "\n @brief Dynamic PCI state"]
pub type ctl_pci_state_t = _ctl_pci_state_t;
#[doc = "\n @brief Properties related to device power settings"]
pub type ctl_power_properties_t = _ctl_power_properties_t;
#[doc = "\n @brief Energy counter snapshot\n\n @details\n     - Average power is calculated by taking two snapshots (s1, s2) and using\n       the equation: PowerWatts = (s2.energy - s1.energy) / (s2.timestamp -\n       s1.timestamp)"]
pub type ctl_power_energy_counter_t = _ctl_power_energy_counter_t;
#[doc = "\n @brief Sustained power limits\n\n @details\n     - The power controller (Punit) will throttle the operating frequency if\n       the power averaged over a window (typically seconds) exceeds this\n       limit."]
pub type ctl_power_sustained_limit_t = _ctl_power_sustained_limit_t;
#[doc = "\n @brief Burst power limit\n\n @details\n     - The power controller (Punit) will throttle the operating frequency of\n       the device if the power averaged over a few milliseconds exceeds a\n       limit known as PL2. Typically PL2 > PL1 so that it permits the\n       frequency to burst higher for short periods than would be otherwise\n       permitted by PL1."]
pub type ctl_power_burst_limit_t = _ctl_power_burst_limit_t;
#[doc = "\n @brief Peak power limit\n\n @details\n     - The power controller (Punit) will preemptively throttle the operating\n       frequency of the device when the instantaneous power exceeds this\n       limit. The limit is known as PL4. It expresses the maximum power that\n       can be drawn from the power supply.\n     - If this power limit is removed or set too high, the power supply will\n       generate an interrupt when it detects an overcurrent condition and the\n       power controller will throttle the device frequencies down to min. It\n       is thus better to tune the PL4 value in order to avoid such\n       excursions."]
pub type ctl_power_peak_limit_t = _ctl_power_peak_limit_t;
#[doc = "\n @brief Power limits"]
pub type ctl_power_limits_t = _ctl_power_limits_t;
#[doc = "\n @brief Energy threshold\n\n @details\n     - ."]
pub type ctl_energy_threshold_t = _ctl_energy_threshold_t;
#[doc = "\n @brief Temperature sensor properties"]
pub type ctl_temp_properties_t = _ctl_temp_properties_t;
#[doc = "< Frame pacing. Contains generic enum type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_FRAME_PACING: _ctl_3d_feature_t = 0;
#[doc = "< Endurance gaming. Contains generic integer type fields. Value will be\n< interpreted as the max FPS to be used when in DC mode globally or per\n< application"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_ENDURANCE_GAMING: _ctl_3d_feature_t = 1;
#[doc = "< Frame limit for games. Contains generic integer type fields. Value\n< will be interpreted as the max FPS to be used independent of system\n< power state"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_FRAME_LIMIT: _ctl_3d_feature_t = 2;
#[doc = "< ANISOTROPIC. Contains generic enum type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_ANISOTROPIC: _ctl_3d_feature_t = 3;
#[doc = "< CMAA. Contains generic enum type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_CMAA: _ctl_3d_feature_t = 4;
#[doc = "< Texture filtering quality. Contains generic enum type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_TEXTURE_FILTERING_QUALITY: _ctl_3d_feature_t = 5;
#[doc = "< Adaptive tessellation quality. Contains generic integer type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_ADAPTIVE_TESSELLATION: _ctl_3d_feature_t = 6;
#[doc = "< Sharpening Filter. Contains generic integer type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_SHARPENING_FILTER: _ctl_3d_feature_t = 7;
#[doc = "< Msaa. Contains generic enum type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_MSAA: _ctl_3d_feature_t = 8;
#[doc = "< Various Gaming flip modes like speed frame, smooth sync & force async\n< flip. Contains generic enum type fields"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_GAMING_FLIP_MODES: _ctl_3d_feature_t = 9;
#[doc = "< Adaptive sync plus. Refer custom field ::ctl_adaptivesync_caps_t &\n< ::ctl_adaptivesync_getset_t"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_ADAPTIVE_SYNC_PLUS: _ctl_3d_feature_t = 10;
#[doc = "< Game Compatibility & Performance Profiles. Refer custom field\n< ::ctl_3d_app_profiles_caps_t & ::ctl_3d_app_profiles_t"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_APP_PROFILES: _ctl_3d_feature_t = 11;
#[doc = "< Game Profile Customization. Refer custom field ::ctl_3d_tier_details_t"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_APP_PROFILE_DETAILS: _ctl_3d_feature_t = 12;
#[doc = "< Emulated Typed 64bit Atomics support in DG2"]
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_EMULATED_TYPED_64BIT_ATOMICS: _ctl_3d_feature_t = 13;
pub const _ctl_3d_feature_t_CTL_3D_FEATURE_MAX: _ctl_3d_feature_t = 14;
#[doc = "\n @brief Feature type"]
pub type _ctl_3d_feature_t = ::std::os::raw::c_int;
#[doc = "\n @brief Feature type"]
pub use self::_ctl_3d_feature_t as ctl_3d_feature_t;
#[doc = "\n @brief 3D feature misc flags"]
pub type ctl_3d_feature_misc_flags_t = u32;
#[doc = "< Feature supported on DX11"]
pub const _ctl_3d_feature_misc_flag_t_CTL_3D_FEATURE_MISC_FLAG_DX11: _ctl_3d_feature_misc_flag_t =
    1;
#[doc = "< Feature supported on DX12"]
pub const _ctl_3d_feature_misc_flag_t_CTL_3D_FEATURE_MISC_FLAG_DX12: _ctl_3d_feature_misc_flag_t =
    2;
#[doc = "< Feature supported on VULKAN"]
pub const _ctl_3d_feature_misc_flag_t_CTL_3D_FEATURE_MISC_FLAG_VULKAN: _ctl_3d_feature_misc_flag_t =
    4;
#[doc = "< User can change feature live without restarting the game"]
pub const _ctl_3d_feature_misc_flag_t_CTL_3D_FEATURE_MISC_FLAG_LIVE_CHANGE:
    _ctl_3d_feature_misc_flag_t = 8;
pub const _ctl_3d_feature_misc_flag_t_CTL_3D_FEATURE_MISC_FLAG_MAX: _ctl_3d_feature_misc_flag_t =
    -2147483648;
pub type _ctl_3d_feature_misc_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_3d_feature_misc_flag_t as ctl_3d_feature_misc_flag_t;
#[doc = "< Application choice"]
pub const _ctl_3d_anisotropic_types_t_CTL_3D_ANISOTROPIC_TYPES_APP_CHOICE:
    _ctl_3d_anisotropic_types_t = 0;
#[doc = "< 2X"]
pub const _ctl_3d_anisotropic_types_t_CTL_3D_ANISOTROPIC_TYPES_2X: _ctl_3d_anisotropic_types_t = 2;
#[doc = "< 4X"]
pub const _ctl_3d_anisotropic_types_t_CTL_3D_ANISOTROPIC_TYPES_4X: _ctl_3d_anisotropic_types_t = 4;
#[doc = "< 8X"]
pub const _ctl_3d_anisotropic_types_t_CTL_3D_ANISOTROPIC_TYPES_8X: _ctl_3d_anisotropic_types_t = 8;
#[doc = "< 16X"]
pub const _ctl_3d_anisotropic_types_t_CTL_3D_ANISOTROPIC_TYPES_16X: _ctl_3d_anisotropic_types_t =
    16;
pub const _ctl_3d_anisotropic_types_t_CTL_3D_ANISOTROPIC_TYPES_MAX: _ctl_3d_anisotropic_types_t =
    17;
#[doc = "\n @brief Anisotropic values possible"]
pub type _ctl_3d_anisotropic_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Anisotropic values possible"]
pub use self::_ctl_3d_anisotropic_types_t as ctl_3d_anisotropic_types_t;
#[doc = "< Performance"]
pub const _ctl_3d_texture_filtering_quality_types_t_CTL_3D_TEXTURE_FILTERING_QUALITY_TYPES_PERFORMANCE : _ctl_3d_texture_filtering_quality_types_t = 0 ;
#[doc = "< Balanced"]
pub const _ctl_3d_texture_filtering_quality_types_t_CTL_3D_TEXTURE_FILTERING_QUALITY_TYPES_BALANCED : _ctl_3d_texture_filtering_quality_types_t = 1 ;
#[doc = "< Quality"]
pub const _ctl_3d_texture_filtering_quality_types_t_CTL_3D_TEXTURE_FILTERING_QUALITY_TYPES_QUALITY : _ctl_3d_texture_filtering_quality_types_t = 2 ;
pub const _ctl_3d_texture_filtering_quality_types_t_CTL_3D_TEXTURE_FILTERING_QUALITY_TYPES_MAX:
    _ctl_3d_texture_filtering_quality_types_t = 3;
#[doc = "\n @brief Texture filtering values possible"]
pub type _ctl_3d_texture_filtering_quality_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Texture filtering values possible"]
pub use self::_ctl_3d_texture_filtering_quality_types_t as ctl_3d_texture_filtering_quality_types_t;
#[doc = "< Disable"]
pub const _ctl_3d_frame_pacing_types_t_CTL_3D_FRAME_PACING_TYPES_DISABLE:
    _ctl_3d_frame_pacing_types_t = 0;
#[doc = "< Enable with scheduler without any frame smoothening"]
pub const _ctl_3d_frame_pacing_types_t_CTL_3D_FRAME_PACING_TYPES_ENABLE_MODE_FRAME_NO_SMOOTHENING : _ctl_3d_frame_pacing_types_t = 1 ;
#[doc = "< Enable with scheduler with maximum smoothness"]
pub const _ctl_3d_frame_pacing_types_t_CTL_3D_FRAME_PACING_TYPES_ENABLE_MODE_FRAME_MAX_SMOOTHENING : _ctl_3d_frame_pacing_types_t = 2 ;
#[doc = "< Enable with scheduler in competitive gaming mode"]
pub const _ctl_3d_frame_pacing_types_t_CTL_3D_FRAME_PACING_TYPES_ENABLE_MODE_COMPETITIVE_GAMING:
    _ctl_3d_frame_pacing_types_t = 3;
pub const _ctl_3d_frame_pacing_types_t_CTL_3D_FRAME_PACING_TYPES_MAX: _ctl_3d_frame_pacing_types_t =
    4;
#[doc = "\n @brief Frame pacing values possible"]
pub type _ctl_3d_frame_pacing_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Frame pacing values possible"]
pub use self::_ctl_3d_frame_pacing_types_t as ctl_3d_frame_pacing_types_t;
#[doc = "< Endurance Gaming disable"]
pub const _ctl_3d_endurance_gaming_control_t_CTL_3D_ENDURANCE_GAMING_CONTROL_TURN_OFF:
    _ctl_3d_endurance_gaming_control_t = 0;
#[doc = "< Endurance Gaming enable"]
pub const _ctl_3d_endurance_gaming_control_t_CTL_3D_ENDURANCE_GAMING_CONTROL_TURN_ON:
    _ctl_3d_endurance_gaming_control_t = 1;
#[doc = "< Endurance Gaming auto"]
pub const _ctl_3d_endurance_gaming_control_t_CTL_3D_ENDURANCE_GAMING_CONTROL_AUTO:
    _ctl_3d_endurance_gaming_control_t = 2;
pub const _ctl_3d_endurance_gaming_control_t_CTL_3D_ENDURANCE_GAMING_CONTROL_MAX:
    _ctl_3d_endurance_gaming_control_t = 3;
#[doc = "\n @brief Endurance Gaming control possible"]
pub type _ctl_3d_endurance_gaming_control_t = ::std::os::raw::c_int;
#[doc = "\n @brief Endurance Gaming control possible"]
pub use self::_ctl_3d_endurance_gaming_control_t as ctl_3d_endurance_gaming_control_t;
#[doc = "< Endurance Gaming better performance mode"]
pub const _ctl_3d_endurance_gaming_mode_t_CTL_3D_ENDURANCE_GAMING_MODE_BETTER_PERFORMANCE:
    _ctl_3d_endurance_gaming_mode_t = 0;
#[doc = "< Endurance Gaming balanced mode"]
pub const _ctl_3d_endurance_gaming_mode_t_CTL_3D_ENDURANCE_GAMING_MODE_BALANCED:
    _ctl_3d_endurance_gaming_mode_t = 1;
#[doc = "< Endurance Gaming maximum battery mode"]
pub const _ctl_3d_endurance_gaming_mode_t_CTL_3D_ENDURANCE_GAMING_MODE_MAXIMUM_BATTERY:
    _ctl_3d_endurance_gaming_mode_t = 2;
pub const _ctl_3d_endurance_gaming_mode_t_CTL_3D_ENDURANCE_GAMING_MODE_MAX:
    _ctl_3d_endurance_gaming_mode_t = 3;
#[doc = "\n @brief Endurance Gaming modes possible"]
pub type _ctl_3d_endurance_gaming_mode_t = ::std::os::raw::c_int;
#[doc = "\n @brief Endurance Gaming modes possible"]
pub use self::_ctl_3d_endurance_gaming_mode_t as ctl_3d_endurance_gaming_mode_t;
#[doc = "< Turn off"]
pub const _ctl_3d_cmaa_types_t_CTL_3D_CMAA_TYPES_TURN_OFF: _ctl_3d_cmaa_types_t = 0;
#[doc = "< Override MSAA"]
pub const _ctl_3d_cmaa_types_t_CTL_3D_CMAA_TYPES_OVERRIDE_MSAA: _ctl_3d_cmaa_types_t = 1;
#[doc = "< Enhance Application"]
pub const _ctl_3d_cmaa_types_t_CTL_3D_CMAA_TYPES_ENHANCE_APPLICATION: _ctl_3d_cmaa_types_t = 2;
pub const _ctl_3d_cmaa_types_t_CTL_3D_CMAA_TYPES_MAX: _ctl_3d_cmaa_types_t = 3;
#[doc = "\n @brief Cmaa values possible"]
pub type _ctl_3d_cmaa_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Cmaa values possible"]
pub use self::_ctl_3d_cmaa_types_t as ctl_3d_cmaa_types_t;
#[doc = "< Turn off"]
pub const _ctl_3d_adaptive_tessellation_types_t_CTL_3D_ADAPTIVE_TESSELLATION_TYPES_TURN_OFF:
    _ctl_3d_adaptive_tessellation_types_t = 0;
#[doc = "< Turn on"]
pub const _ctl_3d_adaptive_tessellation_types_t_CTL_3D_ADAPTIVE_TESSELLATION_TYPES_TURN_ON:
    _ctl_3d_adaptive_tessellation_types_t = 1;
pub const _ctl_3d_adaptive_tessellation_types_t_CTL_3D_ADAPTIVE_TESSELLATION_TYPES_MAX:
    _ctl_3d_adaptive_tessellation_types_t = 2;
#[doc = "\n @brief Adaptive Tessellation"]
pub type _ctl_3d_adaptive_tessellation_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Adaptive Tessellation"]
pub use self::_ctl_3d_adaptive_tessellation_types_t as ctl_3d_adaptive_tessellation_types_t;
#[doc = "< Turn off"]
pub const _ctl_3d_sharpening_filter_types_t_CTL_3D_SHARPENING_FILTER_TYPES_TURN_OFF:
    _ctl_3d_sharpening_filter_types_t = 0;
#[doc = "< Turn on"]
pub const _ctl_3d_sharpening_filter_types_t_CTL_3D_SHARPENING_FILTER_TYPES_TURN_ON:
    _ctl_3d_sharpening_filter_types_t = 1;
pub const _ctl_3d_sharpening_filter_types_t_CTL_3D_SHARPENING_FILTER_TYPES_MAX:
    _ctl_3d_sharpening_filter_types_t = 2;
#[doc = "\n @brief Sharpening filter values possible"]
pub type _ctl_3d_sharpening_filter_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Sharpening filter values possible"]
pub use self::_ctl_3d_sharpening_filter_types_t as ctl_3d_sharpening_filter_types_t;
#[doc = "< Application choice"]
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_APP_CHOICE: _ctl_3d_msaa_types_t = 0;
#[doc = "< Disabled. MSAA count 1"]
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_DISABLED: _ctl_3d_msaa_types_t = 1;
#[doc = "< 2X"]
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_2X: _ctl_3d_msaa_types_t = 2;
#[doc = "< 4X"]
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_4X: _ctl_3d_msaa_types_t = 4;
#[doc = "< 8X"]
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_8X: _ctl_3d_msaa_types_t = 8;
#[doc = "< 16X"]
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_16X: _ctl_3d_msaa_types_t = 16;
pub const _ctl_3d_msaa_types_t_CTL_3D_MSAA_TYPES_MAX: _ctl_3d_msaa_types_t = 17;
#[doc = "\n @brief MSAA values possible"]
pub type _ctl_3d_msaa_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief MSAA values possible"]
pub use self::_ctl_3d_msaa_types_t as ctl_3d_msaa_types_t;
#[doc = "\n @brief Gaming flip modes"]
pub type ctl_gaming_flip_mode_flags_t = u32;
#[doc = "< Application Default"]
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_APPLICATION_DEFAULT:
    _ctl_gaming_flip_mode_flag_t = 1;
#[doc = "< Convert all sync flips to async on the next possible scanline."]
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_VSYNC_OFF:
    _ctl_gaming_flip_mode_flag_t = 2;
#[doc = "< Convert all async flips to sync flips."]
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_VSYNC_ON:
    _ctl_gaming_flip_mode_flag_t = 4;
#[doc = "< Reduce tearing effect with async flips"]
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_SMOOTH_SYNC:
    _ctl_gaming_flip_mode_flag_t = 8;
#[doc = "< Application unaware triple buffering"]
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_SPEED_FRAME:
    _ctl_gaming_flip_mode_flag_t = 16;
#[doc = "< Limit the game FPS to panel RR"]
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_CAPPED_FPS:
    _ctl_gaming_flip_mode_flag_t = 32;
pub const _ctl_gaming_flip_mode_flag_t_CTL_GAMING_FLIP_MODE_FLAG_MAX: _ctl_gaming_flip_mode_flag_t =
    -2147483648;
pub type _ctl_gaming_flip_mode_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_gaming_flip_mode_flag_t as ctl_gaming_flip_mode_flag_t;
#[doc = "\n @brief Endurance Gaming caps"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_endurance_gaming_caps_t {
    #[doc = "< [out] Endurance Gaming control capability"]
    pub EGControlCaps: ctl_property_info_enum_t,
    #[doc = "< [out] Endurance Gaming mode capability"]
    pub EGModeCaps: ctl_property_info_enum_t,
}
#[test]
fn bindgen_test_layout__ctl_endurance_gaming_caps_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_endurance_gaming_caps_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_endurance_gaming_caps_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_endurance_gaming_caps_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_endurance_gaming_caps_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_endurance_gaming_caps_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EGControlCaps) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming_caps_t),
            "::",
            stringify!(EGControlCaps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EGModeCaps) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming_caps_t),
            "::",
            stringify!(EGModeCaps)
        )
    );
}
#[doc = "\n @brief Endurance Gaming Get/Set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_endurance_gaming_t {
    #[doc = "< [in,out] Endurance Gaming control - Off/On/Auto"]
    pub EGControl: ctl_3d_endurance_gaming_control_t,
    #[doc = "< [in,out] Endurance Gaming mode - Better Performance/Balanced/Maximum\n< Battery"]
    pub EGMode: ctl_3d_endurance_gaming_mode_t,
}
#[test]
fn bindgen_test_layout__ctl_endurance_gaming_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_endurance_gaming_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_endurance_gaming_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_endurance_gaming_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_endurance_gaming_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_endurance_gaming_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EGControl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming_t),
            "::",
            stringify!(EGControl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EGMode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming_t),
            "::",
            stringify!(EGMode)
        )
    );
}
#[doc = "\n @brief Endurance Gaming version2 Get/Set"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_endurance_gaming2_t {
    #[doc = "< [in,out] Endurance Gaming control - Off/On/Auto"]
    pub EGControl: ctl_3d_endurance_gaming_control_t,
    #[doc = "< [in,out] Endurance Gaming mode - Better Performance/Balanced/Maximum\n< Battery"]
    pub EGMode: ctl_3d_endurance_gaming_mode_t,
    #[doc = "< [out] Is frame pacing required, dynamic state"]
    pub IsFPRequired: bool,
    #[doc = "< [out] Target FPS for frame pacing"]
    pub TargetFPS: f64,
    #[doc = "< [out] Refresh rate used to calculate target fps"]
    pub RefreshRate: f64,
    #[doc = "< [out] Reserved fields"]
    pub Reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__ctl_endurance_gaming2_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_endurance_gaming2_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_endurance_gaming2_t>(),
        48usize,
        concat!("Size of: ", stringify!(_ctl_endurance_gaming2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_endurance_gaming2_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_endurance_gaming2_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EGControl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming2_t),
            "::",
            stringify!(EGControl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EGMode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming2_t),
            "::",
            stringify!(EGMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsFPRequired) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming2_t),
            "::",
            stringify!(IsFPRequired)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TargetFPS) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming2_t),
            "::",
            stringify!(TargetFPS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RefreshRate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming2_t),
            "::",
            stringify!(RefreshRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_endurance_gaming2_t),
            "::",
            stringify!(Reserved)
        )
    );
}
#[doc = "\n @brief Adaptive sync plus caps"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_adaptivesync_caps_t {
    #[doc = "< [out] Adaptive balance supported"]
    pub AdaptiveBalanceSupported: bool,
    #[doc = "< [out] Strength of adaptive balance algorithm - min/max/steps/default"]
    pub AdaptiveBalanceStrengthCaps: ctl_property_info_float_t,
}
#[test]
fn bindgen_test_layout__ctl_adaptivesync_caps_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_adaptivesync_caps_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_adaptivesync_caps_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_adaptivesync_caps_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_adaptivesync_caps_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_adaptivesync_caps_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdaptiveBalanceSupported) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adaptivesync_caps_t),
            "::",
            stringify!(AdaptiveBalanceSupported)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdaptiveBalanceStrengthCaps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adaptivesync_caps_t),
            "::",
            stringify!(AdaptiveBalanceStrengthCaps)
        )
    );
}
#[doc = "\n @brief Adaptive sync plus"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_adaptivesync_getset_t {
    #[doc = "< [in,out] Adaptive sync. Note that in Windows, OS controls state of\n< adaptive sync and which game gets the feature using it's own policies"]
    pub AdaptiveSync: bool,
    #[doc = "< [in,out] Adaptive balance"]
    pub AdaptiveBalance: bool,
    #[doc = "< [in,out] Allow async flips when FPS is higher than max refresh rate of\n< the panel"]
    pub AllowAsyncForHighFPS: bool,
    #[doc = "< [in,out] Adaptive balance strength"]
    pub AdaptiveBalanceStrength: f32,
}
#[test]
fn bindgen_test_layout__ctl_adaptivesync_getset_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_adaptivesync_getset_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_adaptivesync_getset_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_adaptivesync_getset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_adaptivesync_getset_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_adaptivesync_getset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdaptiveSync) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adaptivesync_getset_t),
            "::",
            stringify!(AdaptiveSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdaptiveBalance) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adaptivesync_getset_t),
            "::",
            stringify!(AdaptiveBalance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AllowAsyncForHighFPS) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adaptivesync_getset_t),
            "::",
            stringify!(AllowAsyncForHighFPS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdaptiveBalanceStrength) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adaptivesync_getset_t),
            "::",
            stringify!(AdaptiveBalanceStrength)
        )
    );
}
#[doc = "\n @brief Game tier types"]
pub type ctl_3d_tier_type_flags_t = u32;
#[doc = "< Compatibility Tier"]
pub const _ctl_3d_tier_type_flag_t_CTL_3D_TIER_TYPE_FLAG_COMPATIBILITY: _ctl_3d_tier_type_flag_t =
    1;
#[doc = "< Performance Tier"]
pub const _ctl_3d_tier_type_flag_t_CTL_3D_TIER_TYPE_FLAG_PERFORMANCE: _ctl_3d_tier_type_flag_t = 2;
pub const _ctl_3d_tier_type_flag_t_CTL_3D_TIER_TYPE_FLAG_MAX: _ctl_3d_tier_type_flag_t =
    -2147483648;
pub type _ctl_3d_tier_type_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_3d_tier_type_flag_t as ctl_3d_tier_type_flag_t;
#[doc = "\n @brief Game tiers"]
pub type ctl_3d_tier_profile_flags_t = u32;
#[doc = "< Tier 1 Profile"]
pub const _ctl_3d_tier_profile_flag_t_CTL_3D_TIER_PROFILE_FLAG_TIER_1: _ctl_3d_tier_profile_flag_t =
    1;
#[doc = "< Tier 2 Profile"]
pub const _ctl_3d_tier_profile_flag_t_CTL_3D_TIER_PROFILE_FLAG_TIER_2: _ctl_3d_tier_profile_flag_t =
    2;
#[doc = "< Recommended Tier Profile. If set other tier values shouldn't be set"]
pub const _ctl_3d_tier_profile_flag_t_CTL_3D_TIER_PROFILE_FLAG_TIER_RECOMMENDED:
    _ctl_3d_tier_profile_flag_t = 1073741824;
pub const _ctl_3d_tier_profile_flag_t_CTL_3D_TIER_PROFILE_FLAG_MAX: _ctl_3d_tier_profile_flag_t =
    -2147483648;
pub type _ctl_3d_tier_profile_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_3d_tier_profile_flag_t as ctl_3d_tier_profile_flag_t;
#[doc = "\n @brief Game Profile Capabilities. Typically these remain the same across\n        games."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_3d_app_profiles_caps_t {
    #[doc = "< [out] Tier of interest for capability check"]
    pub SupportedTierTypes: ctl_3d_tier_type_flags_t,
    #[doc = "< [in,out] Reserved for future"]
    pub Reserved: u64,
}
#[test]
fn bindgen_test_layout__ctl_3d_app_profiles_caps_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_3d_app_profiles_caps_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_3d_app_profiles_caps_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_3d_app_profiles_caps_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_3d_app_profiles_caps_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_3d_app_profiles_caps_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedTierTypes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_caps_t),
            "::",
            stringify!(SupportedTierTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_caps_t),
            "::",
            stringify!(Reserved)
        )
    );
}
#[doc = "\n @brief Game Profile tiers"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_3d_app_profiles_t {
    #[doc = "< [in] Tier type"]
    pub TierType: ctl_3d_tier_type_flag_t,
    #[doc = "< [out] Supported tier profiles bitmask"]
    pub SupportedTierProfiles: ctl_3d_tier_profile_flags_t,
    #[doc = "< [out] Default tiers which driver will enable if there is no user\n< specific setting for global or per application"]
    pub DefaultEnabledTierProfiles: ctl_3d_tier_profile_flags_t,
    #[doc = "< [out] Tiers supporting customization - reserved for future"]
    pub CustomizationSupportedTierProfiles: ctl_3d_tier_profile_flags_t,
    #[doc = "< [in,out] Tier profile(s) to be enabled/disabled in the case of a set\n< call. For a get call this will return the currently enabled tiers"]
    pub EnabledTierProfiles: ctl_3d_tier_profile_flags_t,
    #[doc = "< [in,out] Tier profile(s) which are customized. Caller shall call\n< ::ctl_3d_tier_details_t to get specifics if any."]
    pub CustomizationEnabledTierProfiles: ctl_3d_tier_profile_flags_t,
    #[doc = "< [in,out] Reserved for future"]
    pub Reserved: u64,
}
#[test]
fn bindgen_test_layout__ctl_3d_app_profiles_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_3d_app_profiles_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_3d_app_profiles_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_3d_app_profiles_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_3d_app_profiles_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_3d_app_profiles_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TierType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(TierType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedTierProfiles) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(SupportedTierProfiles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultEnabledTierProfiles) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(DefaultEnabledTierProfiles)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).CustomizationSupportedTierProfiles) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(CustomizationSupportedTierProfiles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnabledTierProfiles) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(EnabledTierProfiles)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).CustomizationEnabledTierProfiles) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(CustomizationEnabledTierProfiles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_app_profiles_t),
            "::",
            stringify!(Reserved)
        )
    );
}
#[doc = "\n @brief Game Profile tiers details"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_3d_tier_details_t {
    #[doc = "< [in] Tier type"]
    pub TierType: ctl_3d_tier_type_flag_t,
    #[doc = "< [in] Tier profile(s) for get/set details"]
    pub TierProfile: ctl_3d_tier_profile_flag_t,
    #[doc = "< [in,out] Reserved for future"]
    pub Reserved: [u64; 4usize],
}
#[test]
fn bindgen_test_layout__ctl_3d_tier_details_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_3d_tier_details_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_3d_tier_details_t>(),
        40usize,
        concat!("Size of: ", stringify!(_ctl_3d_tier_details_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_3d_tier_details_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_3d_tier_details_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TierType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_tier_details_t),
            "::",
            stringify!(TierType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TierProfile) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_tier_details_t),
            "::",
            stringify!(TierProfile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_tier_details_t),
            "::",
            stringify!(Reserved)
        )
    );
}
#[doc = "< Default settings is based on workload/driver decision."]
pub const _ctl_emulated_typed_64bit_atomics_types_t_CTL_EMULATED_TYPED_64BIT_ATOMICS_TYPES_DEFAULT : _ctl_emulated_typed_64bit_atomics_types_t = 0 ;
#[doc = "< Force Turn on"]
pub const _ctl_emulated_typed_64bit_atomics_types_t_CTL_EMULATED_TYPED_64BIT_ATOMICS_TYPES_TURN_ON : _ctl_emulated_typed_64bit_atomics_types_t = 1 ;
#[doc = "< Force Turn off"]
pub const _ctl_emulated_typed_64bit_atomics_types_t_CTL_EMULATED_TYPED_64BIT_ATOMICS_TYPES_TURN_OFF : _ctl_emulated_typed_64bit_atomics_types_t = 2 ;
pub const _ctl_emulated_typed_64bit_atomics_types_t_CTL_EMULATED_TYPED_64BIT_ATOMICS_TYPES_MAX:
    _ctl_emulated_typed_64bit_atomics_types_t = 3;
#[doc = "\n @brief Emulated Typed 64bit Atomics"]
pub type _ctl_emulated_typed_64bit_atomics_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Emulated Typed 64bit Atomics"]
pub use self::_ctl_emulated_typed_64bit_atomics_types_t as ctl_emulated_typed_64bit_atomics_types_t;
#[doc = "\n @brief 3D feature capability details which will have range/supported and\n        default values"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ctl_3d_feature_details_t {
    #[doc = "< [out] 3D feature type"]
    pub FeatureType: ctl_3d_feature_t,
    #[doc = "< [out] Type of value"]
    pub ValueType: ctl_property_value_type_t,
    #[doc = "< [out] Union of various type of values for 3D features. For enum types\n< this can be anisotropic/frame pacing etc. This member is valid iff\n< ValueType is not CTL_PROPERTY_VALUE_TYPE_CUSTOM"]
    pub Value: ctl_property_info_t,
    #[doc = "< [in] CustomValue buffer size. Typically for a feature requiring custom\n< struct, caller will know of it upfront and can provide the right size\n< info here"]
    pub CustomValueSize: i32,
    #[doc = "< [in,out] Pointer to a custom structure. Caller should allocate this\n< buffer with known custom feature structure size. This member is valid\n< iff ValueType is CTL_PROPERTY_VALUE_TYPE_CUSTOM"]
    pub pCustomValue: *mut ::std::os::raw::c_void,
    #[doc = "< [out] Flag indicating whether the feature is supported per application\n< or not"]
    pub PerAppSupport: bool,
    #[doc = "< [out] Mask of ::ctl_3d_feature_t values which can't be enabled along\n< with the mentioned FeatureType. If this is 0, it meant the feature\n< doesn't have any conflicts with other features"]
    pub ConflictingFeatures: i64,
    #[doc = "< [out] 3D Feature Miscellaneous support flags. This will be based on\n< ::ctl_3d_feature_misc_flags_t"]
    pub FeatureMiscSupport: i16,
    #[doc = "< [out] Reserved"]
    pub Reserved: i16,
    #[doc = "< [out] Reserved"]
    pub Reserved1: i16,
    #[doc = "< [out] Reserved"]
    pub Reserved2: i16,
}
#[test]
fn bindgen_test_layout__ctl_3d_feature_details_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_3d_feature_details_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_3d_feature_details_t>(),
        72usize,
        concat!("Size of: ", stringify!(_ctl_3d_feature_details_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_3d_feature_details_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_3d_feature_details_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(FeatureType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ValueType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(ValueType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(Value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CustomValueSize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(CustomValueSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCustomValue) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(pCustomValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PerAppSupport) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(PerAppSupport)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConflictingFeatures) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(ConflictingFeatures)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureMiscSupport) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(FeatureMiscSupport)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(Reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_details_t),
            "::",
            stringify!(Reserved2)
        )
    );
}
#[doc = "\n @brief 3D feature which are controllable"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_3d_feature_caps_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Number of elements in supported features array"]
    pub NumSupportedFeatures: u32,
    #[doc = "< [in,out] Array of feature details"]
    pub pFeatureDetails: *mut ctl_3d_feature_details_t,
}
#[test]
fn bindgen_test_layout__ctl_3d_feature_caps_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_3d_feature_caps_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_3d_feature_caps_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_3d_feature_caps_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_3d_feature_caps_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_3d_feature_caps_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_caps_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_caps_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumSupportedFeatures) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_caps_t),
            "::",
            stringify!(NumSupportedFeatures)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFeatureDetails) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_caps_t),
            "::",
            stringify!(pFeatureDetails)
        )
    );
}
#[doc = "\n @brief 3D feature for get/set"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ctl_3d_feature_getset_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Features interested in"]
    pub FeatureType: ctl_3d_feature_t,
    #[doc = "< [in] Application name for which the property type is applicable. If\n< this is an empty string then this will get/set global settings for the\n< given adapter. Note that this should contain only the name of the\n< application and not the system specific path"]
    pub ApplicationName: *mut ::std::os::raw::c_char,
    #[doc = "< [in] Length of ApplicationName string"]
    pub ApplicationNameLength: i8,
    #[doc = "< [in] Set this if it's a set call"]
    pub bSet: bool,
    #[doc = "< [in] Type of value. Caller has to ensure it provides the right value\n< type which decides how one read the union structure below"]
    pub ValueType: ctl_property_value_type_t,
    #[doc = "< [in,out] Union of various type of values for 3D features. For enum\n< types this can be anisotropic/frame pacing etc. This member is valid\n< iff ValueType is not CTL_PROPERTY_VALUE_TYPE_CUSTOM"]
    pub Value: ctl_property_t,
    #[doc = "< [in] CustomValue buffer size. Typically for a feature requiring custom\n< struct, caller will know of it upfront and cn provide the right size\n< info here"]
    pub CustomValueSize: i32,
    #[doc = "< [in,out] Pointer to a custom structure. Caller should allocate this\n< buffer with known custom feature structure size. This member is valid\n< iff ValueType is CTL_PROPERTY_VALUE_TYPE_CUSTOM"]
    pub pCustomValue: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__ctl_3d_feature_getset_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_3d_feature_getset_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_3d_feature_getset_t>(),
        56usize,
        concat!("Size of: ", stringify!(_ctl_3d_feature_getset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_3d_feature_getset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_3d_feature_getset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(FeatureType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(ApplicationName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationNameLength) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(ApplicationNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSet) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(bSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ValueType) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(ValueType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(Value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CustomValueSize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(CustomValueSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCustomValue) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_3d_feature_getset_t),
            "::",
            stringify!(pCustomValue)
        )
    );
}
#[doc = "\n @brief Load KMD gaming features. Restricted function"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_kmd_load_features_t {
    #[doc = "< [in] Unique ID for reserved/special function"]
    pub ReservedFuncID: ctl_application_id_t,
    #[doc = "< [in] If set, will load known KMD features. If not set will reset known\n< KMD features to default"]
    pub bLoad: bool,
    #[doc = "< [in,out] Mask indicating the subset of KMD features within\n< ::ctl_3d_feature_t values. Default of 0 indicate all KMD features"]
    pub SubsetFeatureMask: i64,
    #[doc = "< [in] Application name for which the KMD properties are loaded for. If\n< this is an empty string then this will load global settings for the\n< given adapter. Note that this should contain only the name of the\n< application and not the system specific path"]
    pub ApplicationName: *mut ::std::os::raw::c_char,
    #[doc = "< [in] Length of ApplicationName string"]
    pub ApplicationNameLength: i8,
}
#[test]
fn bindgen_test_layout__ctl_kmd_load_features_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_kmd_load_features_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_kmd_load_features_t>(),
        48usize,
        concat!("Size of: ", stringify!(_ctl_kmd_load_features_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_kmd_load_features_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_kmd_load_features_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFuncID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_kmd_load_features_t),
            "::",
            stringify!(ReservedFuncID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLoad) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_kmd_load_features_t),
            "::",
            stringify!(bLoad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SubsetFeatureMask) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_kmd_load_features_t),
            "::",
            stringify!(SubsetFeatureMask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationName) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_kmd_load_features_t),
            "::",
            stringify!(ApplicationName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationNameLength) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_kmd_load_features_t),
            "::",
            stringify!(ApplicationNameLength)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Get 3D capabilities\n\n @details\n     - The application gets 3D properties\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDAhandle`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pFeatureCaps`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetSupported3DCapabilities(
        hDAhandle: ctl_device_adapter_handle_t,
        pFeatureCaps: *mut ctl_3d_feature_caps_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Get/Set 3D feature\n\n @details\n     - 3D feature details\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDAhandle`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pFeature`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetSet3DFeature(
        hDAhandle: ctl_device_adapter_handle_t,
        pFeature: *mut ctl_3d_feature_getset_t,
    ) -> ctl_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_display_output_handle_t {
    _unused: [u8; 0],
}
#[doc = "\n @brief Handle of a display output instance"]
pub type ctl_display_output_handle_t = *mut _ctl_display_output_handle_t;
extern "C" {
    #[doc = "\n @brief Check Driver version\n\n @details\n     - The application checks driver version\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDeviceAdapter`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlCheckDriverVersion(
        hDeviceAdapter: ctl_device_adapter_handle_t,
        version_info: ctl_version_info_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Enumerate devices\n\n @details\n     - The application enumerates all device adapters in the system\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hAPIHandle`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pCount`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlEnumerateDevices(
        hAPIHandle: ctl_api_handle_t,
        pCount: *mut u32,
        phDevices: *mut ctl_device_adapter_handle_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Enumerate display outputs\n\n @details\n     - Enumerates display output capabilities\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDeviceAdapter`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pCount`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlEnumerateDisplayOutputs(
        hDeviceAdapter: ctl_device_adapter_handle_t,
        pCount: *mut u32,
        phDisplayOutputs: *mut ctl_display_output_handle_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief OS specific Display identifiers"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ctl_os_display_encoder_identifier_t {
    #[doc = "< [out] Windows OS Display encoder ID"]
    pub WindowsDisplayEncoderID: u32,
    #[doc = "< [out] Display encoder ID for non-windows OS"]
    pub DisplayEncoderID: ctl_generic_void_datatype_t,
}
#[test]
fn bindgen_test_layout__ctl_os_display_encoder_identifier_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_os_display_encoder_identifier_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_os_display_encoder_identifier_t>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_ctl_os_display_encoder_identifier_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_os_display_encoder_identifier_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_os_display_encoder_identifier_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WindowsDisplayEncoderID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_os_display_encoder_identifier_t),
            "::",
            stringify!(WindowsDisplayEncoderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisplayEncoderID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_os_display_encoder_identifier_t),
            "::",
            stringify!(DisplayEncoderID)
        )
    );
}
#[doc = "\n @brief OS specific Display identifiers"]
pub type ctl_os_display_encoder_identifier_t = _ctl_os_display_encoder_identifier_t;
#[doc = "< Invalid"]
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_INVALID:
    _ctl_display_output_types_t = 0;
#[doc = "< DisplayPort"]
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_DISPLAYPORT:
    _ctl_display_output_types_t = 1;
#[doc = "< HDMI"]
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_HDMI: _ctl_display_output_types_t =
    2;
#[doc = "< DVI"]
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_DVI: _ctl_display_output_types_t = 3;
#[doc = "< MIPI"]
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_MIPI: _ctl_display_output_types_t =
    4;
#[doc = "< CRT"]
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_CRT: _ctl_display_output_types_t = 5;
pub const _ctl_display_output_types_t_CTL_DISPLAY_OUTPUT_TYPES_MAX: _ctl_display_output_types_t = 6;
#[doc = "\n @brief Various display types"]
pub type _ctl_display_output_types_t = ::std::os::raw::c_int;
#[doc = "\n @brief Various display types"]
pub use self::_ctl_display_output_types_t as ctl_display_output_types_t;
#[doc = "\n @brief Supported output bits per color (bpc) bitmasks"]
pub type ctl_output_bpc_flags_t = u32;
#[doc = "< [out] Is 6bpc supported"]
pub const _ctl_output_bpc_flag_t_CTL_OUTPUT_BPC_FLAG_6BPC: _ctl_output_bpc_flag_t = 1;
#[doc = "< [out] Is 8bpc supported"]
pub const _ctl_output_bpc_flag_t_CTL_OUTPUT_BPC_FLAG_8BPC: _ctl_output_bpc_flag_t = 2;
#[doc = "< [out] Is 10bpc supported"]
pub const _ctl_output_bpc_flag_t_CTL_OUTPUT_BPC_FLAG_10BPC: _ctl_output_bpc_flag_t = 4;
#[doc = "< [out] Is 12bpc supported"]
pub const _ctl_output_bpc_flag_t_CTL_OUTPUT_BPC_FLAG_12BPC: _ctl_output_bpc_flag_t = 8;
pub const _ctl_output_bpc_flag_t_CTL_OUTPUT_BPC_FLAG_MAX: _ctl_output_bpc_flag_t = -2147483648;
pub type _ctl_output_bpc_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_output_bpc_flag_t as ctl_output_bpc_flag_t;
#[doc = "\n @brief Display output features. This will indicate only the high level\n        capabilities"]
pub type ctl_std_display_feature_flags_t = u32;
#[doc = "< [out] Is HDCP supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_HDCP:
    _ctl_std_display_feature_flag_t = 1;
#[doc = "< [out] Is HD Audio supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_HD_AUDIO:
    _ctl_std_display_feature_flag_t = 2;
#[doc = "< [out] Is VESA PSR supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_PSR:
    _ctl_std_display_feature_flag_t = 4;
#[doc = "< [out] Is VESA Adaptive Sync or HDMI VRR supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_ADAPTIVESYNC_VRR:
    _ctl_std_display_feature_flag_t = 8;
#[doc = "< [out] Is display compression (VESA DSC) supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_VESA_COMPRESSION:
    _ctl_std_display_feature_flag_t = 16;
#[doc = "< [out] Is HDR supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_HDR:
    _ctl_std_display_feature_flag_t = 32;
#[doc = "< [out] Is HDMI QMS supported"]
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_HDMI_QMS:
    _ctl_std_display_feature_flag_t = 64;
pub const _ctl_std_display_feature_flag_t_CTL_STD_DISPLAY_FEATURE_FLAG_MAX:
    _ctl_std_display_feature_flag_t = -2147483648;
pub type _ctl_std_display_feature_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_std_display_feature_flag_t as ctl_std_display_feature_flag_t;
#[doc = "\n @brief Advanced Graphics Features provided by Intel Graphics Adapter. This\n        will indicate only the high level capabilities"]
pub type ctl_intel_display_feature_flags_t = u32;
#[doc = "< [out] Is DPST supported"]
pub const _ctl_intel_display_feature_flag_t_CTL_INTEL_DISPLAY_FEATURE_FLAG_DPST:
    _ctl_intel_display_feature_flag_t = 1;
#[doc = "< [out] Is LACE supported"]
pub const _ctl_intel_display_feature_flag_t_CTL_INTEL_DISPLAY_FEATURE_FLAG_LACE:
    _ctl_intel_display_feature_flag_t = 2;
#[doc = "< [out] Is DRRS supported"]
pub const _ctl_intel_display_feature_flag_t_CTL_INTEL_DISPLAY_FEATURE_FLAG_DRRS:
    _ctl_intel_display_feature_flag_t = 4;
pub const _ctl_intel_display_feature_flag_t_CTL_INTEL_DISPLAY_FEATURE_FLAG_MAX:
    _ctl_intel_display_feature_flag_t = -2147483648;
pub type _ctl_intel_display_feature_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_intel_display_feature_flag_t as ctl_intel_display_feature_flag_t;
#[doc = "< [out] Native DP / HDMI"]
pub const _ctl_attached_display_mux_type_t_CTL_ATTACHED_DISPLAY_MUX_TYPE_NATIVE:
    _ctl_attached_display_mux_type_t = 0;
#[doc = "< [out] Thunderbolt"]
pub const _ctl_attached_display_mux_type_t_CTL_ATTACHED_DISPLAY_MUX_TYPE_THUNDERBOLT:
    _ctl_attached_display_mux_type_t = 1;
#[doc = "< [out] USB Type C"]
pub const _ctl_attached_display_mux_type_t_CTL_ATTACHED_DISPLAY_MUX_TYPE_TYPE_C:
    _ctl_attached_display_mux_type_t = 2;
#[doc = "< [out] USB4"]
pub const _ctl_attached_display_mux_type_t_CTL_ATTACHED_DISPLAY_MUX_TYPE_USB4:
    _ctl_attached_display_mux_type_t = 3;
pub const _ctl_attached_display_mux_type_t_CTL_ATTACHED_DISPLAY_MUX_TYPE_MAX:
    _ctl_attached_display_mux_type_t = 4;
#[doc = "\n @brief Attached Display Mux Type"]
pub type _ctl_attached_display_mux_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Attached Display Mux Type"]
pub use self::_ctl_attached_display_mux_type_t as ctl_attached_display_mux_type_t;
#[doc = "< [out] Unknown Signal Standard"]
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_UNKNOWN:
    _ctl_signal_standard_type_t = 0;
#[doc = "< [out] Custom added timing"]
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_CUSTOM: _ctl_signal_standard_type_t =
    1;
#[doc = "< [out] DMT timing"]
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_DMT: _ctl_signal_standard_type_t = 2;
#[doc = "< [out] GTF Timing"]
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_GTF: _ctl_signal_standard_type_t = 3;
#[doc = "< [out] CVT Timing"]
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_CVT: _ctl_signal_standard_type_t = 4;
#[doc = "< [out] CTA Timing"]
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_CTA: _ctl_signal_standard_type_t = 5;
pub const _ctl_signal_standard_type_t_CTL_SIGNAL_STANDARD_TYPE_MAX: _ctl_signal_standard_type_t = 6;
#[doc = "\n @brief Signal Standard"]
pub type _ctl_signal_standard_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Signal Standard"]
pub use self::_ctl_signal_standard_type_t as ctl_signal_standard_type_t;
#[doc = "\n @brief Protocol Converter Location"]
pub type ctl_protocol_converter_location_flags_t = u32;
#[doc = "< [out] OnBoard Protocol Converter"]
pub const _ctl_protocol_converter_location_flag_t_CTL_PROTOCOL_CONVERTER_LOCATION_FLAG_ONBOARD:
    _ctl_protocol_converter_location_flag_t = 1;
#[doc = "< [out] External Dongle"]
pub const _ctl_protocol_converter_location_flag_t_CTL_PROTOCOL_CONVERTER_LOCATION_FLAG_EXTERNAL:
    _ctl_protocol_converter_location_flag_t = 2;
pub const _ctl_protocol_converter_location_flag_t_CTL_PROTOCOL_CONVERTER_LOCATION_FLAG_MAX:
    _ctl_protocol_converter_location_flag_t = -2147483648;
pub type _ctl_protocol_converter_location_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_protocol_converter_location_flag_t as ctl_protocol_converter_location_flag_t;
#[doc = "\n @brief [out] Display Output configuration related flags which indicate how\n        the output pixel stream drive the panel"]
pub type ctl_display_config_flags_t = u32;
#[doc = "< [out] DisplayActive 0: InActive 1: Active"]
pub const _ctl_display_config_flag_t_CTL_DISPLAY_CONFIG_FLAG_DISPLAY_ACTIVE:
    _ctl_display_config_flag_t = 1;
#[doc = "< [out] DisplayAttached.This Bit indicates if any dongle/display/hub is\n< attached to the encoder. 0: Not Attached 1: Attached"]
pub const _ctl_display_config_flag_t_CTL_DISPLAY_CONFIG_FLAG_DISPLAY_ATTACHED:
    _ctl_display_config_flag_t = 2;
#[doc = "< [out] This BIT will be set if a dongle/hub/onboard protocol converter\n< , is attached to the encoder"]
pub const _ctl_display_config_flag_t_CTL_DISPLAY_CONFIG_FLAG_IS_DONGLE_CONNECTED_TO_ENCODER:
    _ctl_display_config_flag_t = 4;
#[doc = "< [out] This BIT will be set if dithering is enabled on the encoder"]
pub const _ctl_display_config_flag_t_CTL_DISPLAY_CONFIG_FLAG_DITHERING_ENABLED:
    _ctl_display_config_flag_t = 8;
pub const _ctl_display_config_flag_t_CTL_DISPLAY_CONFIG_FLAG_MAX: _ctl_display_config_flag_t =
    -2147483648;
pub type _ctl_display_config_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_display_config_flag_t as ctl_display_config_flag_t;
#[doc = "\n @brief [out] Encoder configuration related flags which indicate how the\n        output pixel stream drive the panel"]
pub type ctl_encoder_config_flags_t = u32;
#[doc = "< [out] Internal connection or not"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_INTERNAL_DISPLAY:
    _ctl_encoder_config_flag_t = 1;
#[doc = "< [out] VESA DisplayID based tiled display which is driven by either\n< multiple physical connections (DisplayPort SST) or virtual streams\n< (DisplayPort MST)"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_VESA_TILED_DISPLAY:
    _ctl_encoder_config_flag_t = 2;
#[doc = "< [out] This is set if encoder supports type c display"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_TYPEC_CAPABLE:
    _ctl_encoder_config_flag_t = 4;
#[doc = "< [out] This is set if encoder supports Thunderbolt display"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_TBT_CAPABLE:
    _ctl_encoder_config_flag_t = 8;
#[doc = "< [out] This BIT will be set if encoder supports dithering"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_DITHERING_SUPPORTED:
    _ctl_encoder_config_flag_t = 16;
#[doc = "< [out] This BIT will be set if this is a virtual display.Hardware based\n< features will not be applicable to this display.For collage display\n< this will be set for the virtual output created by driver. For split\n< display this will be set for the virtual split displays created out of\n< one single physical display"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_VIRTUAL_DISPLAY:
    _ctl_encoder_config_flag_t = 32;
#[doc = "< [out] This BIT will be set if display is hidden from OS"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_HIDDEN_DISPLAY:
    _ctl_encoder_config_flag_t = 64;
#[doc = "< [out] This BIT will be set if this is a collage display"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_COLLAGE_DISPLAY:
    _ctl_encoder_config_flag_t = 128;
#[doc = "< [out] This BIT will be set if this is a split display"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_SPLIT_DISPLAY:
    _ctl_encoder_config_flag_t = 256;
#[doc = "< [out] This BIT will be set if this is a companion display"]
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_COMPANION_DISPLAY:
    _ctl_encoder_config_flag_t = 512;
pub const _ctl_encoder_config_flag_t_CTL_ENCODER_CONFIG_FLAG_MAX: _ctl_encoder_config_flag_t =
    -2147483648;
pub type _ctl_encoder_config_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_encoder_config_flag_t as ctl_encoder_config_flag_t;
#[doc = "\n @brief Display Timing"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_display_timing_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] Pixel Clock in Hz"]
    pub PixelClock: u64,
    #[doc = "< [out] Horizontal Active"]
    pub HActive: u32,
    #[doc = "< [out] Vertical Active"]
    pub VActive: u32,
    #[doc = "< [out] Horizontal Total"]
    pub HTotal: u32,
    #[doc = "< [out] Vertical Total"]
    pub VTotal: u32,
    #[doc = "< [out] Horizontal Blank"]
    pub HBlank: u32,
    #[doc = "< [out] Vertical Blank"]
    pub VBlank: u32,
    #[doc = "< [out] Horizontal Blank"]
    pub HSync: u32,
    #[doc = "< [out] Vertical Blank"]
    pub VSync: u32,
    #[doc = "< [out] Refresh Rate"]
    pub RefreshRate: f32,
    #[doc = "< [out] Signal Standard"]
    pub SignalStandard: ctl_signal_standard_type_t,
    #[doc = "< [out] VIC ID for CTA timings"]
    pub VicId: u8,
}
#[test]
fn bindgen_test_layout__ctl_display_timing_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_display_timing_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_display_timing_t>(),
        64usize,
        concat!("Size of: ", stringify!(_ctl_display_timing_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_display_timing_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_display_timing_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PixelClock) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(PixelClock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HActive) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(HActive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VActive) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(VActive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HTotal) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(HTotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VTotal) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(VTotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HBlank) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(HBlank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VBlank) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(VBlank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HSync) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(HSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VSync) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(VSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RefreshRate) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(RefreshRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SignalStandard) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(SignalStandard)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VicId) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_timing_t),
            "::",
            stringify!(VicId)
        )
    );
}
#[doc = "\n @brief This structure will contain the properties of the display currently\n        attached to the encoder."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ctl_display_properties_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] OS specific Display ID"]
    pub Os_display_encoder_handle: ctl_os_display_encoder_identifier_t,
    #[doc = "< [out] Device Type from display HW stand point. If a DisplayPort\n< protocol converter is involved, this will indicate it's DisplayPort.\n< The protocol converter's output will be available from\n< ProtocolConverterOutput field"]
    pub Type: ctl_display_output_types_t,
    #[doc = "< [out] Attached Display Mux Type"]
    pub AttachedDisplayMuxType: ctl_attached_display_mux_type_t,
    #[doc = "< [out] Protocol output type which can be used if config flags indicate\n< it's a protocol converter. If it's not a protocol converter this will\n< be set to CTL_DISPLAY_OUTPUT_TYPES_INVALID"]
    pub ProtocolConverterOutput: ctl_display_output_types_t,
    #[doc = "< [out] Supported industry spec version."]
    pub SupportedSpec: ctl_revision_datatype_t,
    #[doc = "< [out] Supported output bits per color. Refer ::ctl_output_bpc_flag_t.\n< This is independent of RGB or YCbCr output.This is the max BPC\n< supported.BPC will vary per mode based on restrictions like bandwidth\n< and monitor support"]
    pub SupportedOutputBPCFlags: ctl_output_bpc_flags_t,
    #[doc = "< [out] Currently Active Protocol Converter. Refer\n< ::ctl_protocol_converter_location_flag_t"]
    pub ProtocolConverterType: ctl_protocol_converter_location_flags_t,
    #[doc = "< [out] Output configuration related flags which indicate how the output\n< pixel stream drive the panel. Refer ::ctl_display_config_flag_t"]
    pub DisplayConfigFlags: ctl_display_config_flags_t,
    #[doc = "< [out] Enabled Display features.Refer ::ctl_std_display_feature_flag_t."]
    pub FeatureEnabledFlags: ctl_std_display_feature_flags_t,
    #[doc = "< [out] Display Supported feature.Refer ::ctl_std_display_feature_flag_t"]
    pub FeatureSupportedFlags: ctl_std_display_feature_flags_t,
    #[doc = "< [out] Enabled advanced feature.Refer\n< ::ctl_intel_display_feature_flag_t."]
    pub AdvancedFeatureEnabledFlags: ctl_intel_display_feature_flags_t,
    #[doc = "< [out] Supported advanced feature.Refer\n< ::ctl_intel_display_feature_flag_t."]
    pub AdvancedFeatureSupportedFlags: ctl_intel_display_feature_flags_t,
    #[doc = "< [out] Applied Timing on the Display"]
    pub Display_Timing_Info: ctl_display_timing_t,
    #[doc = "< [out] Reserved field of 64 bytes"]
    pub ReservedFields: [u32; 16usize],
}
#[test]
fn bindgen_test_layout__ctl_display_properties_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_display_properties_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_display_properties_t>(),
        200usize,
        concat!("Size of: ", stringify!(_ctl_display_properties_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_display_properties_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_display_properties_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Os_display_encoder_handle) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(Os_display_encoder_handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AttachedDisplayMuxType) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(AttachedDisplayMuxType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProtocolConverterOutput) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(ProtocolConverterOutput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedSpec) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(SupportedSpec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedOutputBPCFlags) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(SupportedOutputBPCFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProtocolConverterType) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(ProtocolConverterType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisplayConfigFlags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(DisplayConfigFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureEnabledFlags) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(FeatureEnabledFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureSupportedFlags) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(FeatureSupportedFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdvancedFeatureEnabledFlags) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(AdvancedFeatureEnabledFlags)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).AdvancedFeatureSupportedFlags) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(AdvancedFeatureSupportedFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Display_Timing_Info) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(Display_Timing_Info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFields) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_display_properties_t),
            "::",
            stringify!(ReservedFields)
        )
    );
}
#[doc = "\n @brief Adapter's display encoder properties"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ctl_adapter_display_encoder_properties_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] OS specific Display ID"]
    pub Os_display_encoder_handle: ctl_os_display_encoder_identifier_t,
    #[doc = "< [out] Device Type from display HW stand point. If a DisplayPort\n< protocol converter is involved, this will indicate it's DisplayPort.\n< The protocol converter's output will be available from\n< ProtocolConverterOutput field"]
    pub Type: ctl_display_output_types_t,
    #[doc = "< [out] Protocol output type which can be used if it's a protocol\n< converter. If it's not a protocol converter this will be set to\n< CTL_DISPLAY_OUTPUT_TYPES_INVALID"]
    pub IsOnBoardProtocolConverterOutputPresent: bool,
    #[doc = "< [out] Supported industry spec version"]
    pub SupportedSpec: ctl_revision_datatype_t,
    #[doc = "< [out] Supported output bits per color. Refer ::ctl_output_bpc_flag_t.\n< This is independent of RGB or YCbCr output.This is the max BPC\n< supported.BPC will vary per mode based on restrictions like bandwidth\n< and monitor support"]
    pub SupportedOutputBPCFlags: ctl_output_bpc_flags_t,
    #[doc = "< [out] Output configuration related flags which indicate how the output\n< pixel stream drive the panel. Refer ::ctl_encoder_config_flag_t\n< Note:\n<    Virtual = 1: This indicates that its a software display. Hardware\n< based features will not be applicable to this display.\n<    Collage=1,Virtual=1: Indicates the fake display output created by\n< driver which has the combined resolution of multiple physical displays\n< involved in collage configuration\n<    Collage=1,Virtual=0: Indicates the child physical displays involved\n< in a collage configuration. These are real physical outputs\n<    Split=1,Virtual=1  : Indicates the fake display output created by\n< driver which occupies a portion of a real physical display\n<    Split=1,Virtual=0  : Indicates the physical display which got split\n< to form multiple split displays\n<    Split=1,Collage=1  : Invalid combination"]
    pub EncoderConfigFlags: ctl_encoder_config_flags_t,
    #[doc = "< [out] Adapter Supported feature flags. Refer\n< ::ctl_std_display_feature_flag_t"]
    pub FeatureSupportedFlags: ctl_std_display_feature_flags_t,
    #[doc = "< [out] Advanced Features Supported by the Adapter. Refer\n< ::ctl_intel_display_feature_flag_t"]
    pub AdvancedFeatureSupportedFlags: ctl_intel_display_feature_flags_t,
    #[doc = "< [out] Reserved field of 64 bytes"]
    pub ReservedFields: [u32; 16usize],
}
#[test]
fn bindgen_test_layout__ctl_adapter_display_encoder_properties_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_adapter_display_encoder_properties_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_adapter_display_encoder_properties_t>(),
        112usize,
        concat!(
            "Size of: ",
            stringify!(_ctl_adapter_display_encoder_properties_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_adapter_display_encoder_properties_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_adapter_display_encoder_properties_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Os_display_encoder_handle) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(Os_display_encoder_handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsOnBoardProtocolConverterOutputPresent) as usize
                - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(IsOnBoardProtocolConverterOutputPresent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedSpec) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(SupportedSpec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedOutputBPCFlags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(SupportedOutputBPCFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EncoderConfigFlags) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(EncoderConfigFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureSupportedFlags) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(FeatureSupportedFlags)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).AdvancedFeatureSupportedFlags) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(AdvancedFeatureSupportedFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFields) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_adapter_display_encoder_properties_t),
            "::",
            stringify!(ReservedFields)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Get Device Properties\n\n @details\n     - The application gets device properties\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDAhandle`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pProperties`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetDeviceProperties(
        hDAhandle: ctl_device_adapter_handle_t,
        pProperties: *mut ctl_device_adapter_properties_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Get Display  Properties\n\n @details\n     - The application gets display  properties\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pProperties`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetDisplayProperties(
        hDisplayOutput: ctl_display_output_handle_t,
        pProperties: *mut ctl_display_properties_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Get Adapter Display encoder  Properties\n\n @details\n     - The application gets the graphic adapters display encoder properties\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pProperties`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetAdaperDisplayEncoderProperties(
        hDisplayOutput: ctl_display_output_handle_t,
        pProperties: *mut ctl_adapter_display_encoder_properties_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Get Level0 Device handle\n\n @details\n     - The application gets OneAPI Level0 Device handles\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDAhandle`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pZeDevice`\n         + `nullptr == hInstance`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetZeDevice(
        hDAhandle: ctl_device_adapter_handle_t,
        pZeDevice: *mut ::std::os::raw::c_void,
        hInstance: *mut *mut ::std::os::raw::c_void,
    ) -> ctl_result_t;
}
#[doc = "\n @brief Various sharpness filter types"]
pub type ctl_sharpness_filter_type_flags_t = u32;
#[doc = "< Non-adaptive sharpness"]
pub const _ctl_sharpness_filter_type_flag_t_CTL_SHARPNESS_FILTER_TYPE_FLAG_NON_ADAPTIVE:
    _ctl_sharpness_filter_type_flag_t = 1;
#[doc = "< Adaptive sharpness"]
pub const _ctl_sharpness_filter_type_flag_t_CTL_SHARPNESS_FILTER_TYPE_FLAG_ADAPTIVE:
    _ctl_sharpness_filter_type_flag_t = 2;
pub const _ctl_sharpness_filter_type_flag_t_CTL_SHARPNESS_FILTER_TYPE_FLAG_MAX:
    _ctl_sharpness_filter_type_flag_t = -2147483648;
pub type _ctl_sharpness_filter_type_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_sharpness_filter_type_flag_t as ctl_sharpness_filter_type_flag_t;
#[doc = "\n @brief Sharpness filter properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_sharpness_filter_properties_t {
    #[doc = "< [out] Filter type. Refer ::ctl_sharpness_filter_type_flag_t"]
    pub FilterType: ctl_sharpness_filter_type_flags_t,
    #[doc = "< [out] Min, max & step size information"]
    pub FilterDetails: ctl_property_range_info_t,
}
#[test]
fn bindgen_test_layout__ctl_sharpness_filter_properties_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_sharpness_filter_properties_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_sharpness_filter_properties_t>(),
        20usize,
        concat!("Size of: ", stringify!(_ctl_sharpness_filter_properties_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_sharpness_filter_properties_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_sharpness_filter_properties_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FilterType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_filter_properties_t),
            "::",
            stringify!(FilterType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FilterDetails) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_filter_properties_t),
            "::",
            stringify!(FilterDetails)
        )
    );
}
#[doc = "\n @brief Various sharpness filter types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_sharpness_caps_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] Supported sharpness filters for a given display output. Refer\n< ::ctl_sharpness_filter_type_flag_t"]
    pub SupportedFilterFlags: ctl_sharpness_filter_type_flags_t,
    #[doc = "< [out] Number of elements in filter properties array"]
    pub NumFilterTypes: u8,
    #[doc = "< [in,out] Array of filter properties structure describing supported\n< filter capabilities. Caller should provide a pre-allocated memory for\n< this."]
    pub pFilterProperty: *mut ctl_sharpness_filter_properties_t,
}
#[test]
fn bindgen_test_layout__ctl_sharpness_caps_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_sharpness_caps_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_sharpness_caps_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_sharpness_caps_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_sharpness_caps_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_sharpness_caps_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_caps_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_caps_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedFilterFlags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_caps_t),
            "::",
            stringify!(SupportedFilterFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumFilterTypes) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_caps_t),
            "::",
            stringify!(NumFilterTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFilterProperty) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_caps_t),
            "::",
            stringify!(pFilterProperty)
        )
    );
}
#[doc = "\n @brief Current sharpness setting"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_sharpness_settings_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Current or new state of sharpness setting"]
    pub Enable: bool,
    #[doc = "< [in,out] Current or new filter to be set. Refer\n< ::ctl_sharpness_filter_type_flag_t"]
    pub FilterType: ctl_sharpness_filter_type_flags_t,
    #[doc = "< [in,out] Setting intensity to be applied"]
    pub Intensity: f32,
}
#[test]
fn bindgen_test_layout__ctl_sharpness_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_sharpness_settings_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_sharpness_settings_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_sharpness_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_sharpness_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_sharpness_settings_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_settings_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_settings_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_settings_t),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FilterType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_settings_t),
            "::",
            stringify!(FilterType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Intensity) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_sharpness_settings_t),
            "::",
            stringify!(Intensity)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Get Sharpness capability\n\n @details\n     - Returns sharpness capability\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pSharpnessCaps`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetSharpnessCaps(
        hDisplayOutput: ctl_display_output_handle_t,
        pSharpnessCaps: *mut ctl_sharpness_caps_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Get Sharpness setting\n\n @details\n     - Returns current sharpness settings\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pSharpnessSettings`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetCurrentSharpness(
        hDisplayOutput: ctl_display_output_handle_t,
        pSharpnessSettings: *mut ctl_sharpness_settings_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Set Sharpness setting\n\n @details\n     - Set current sharpness settings\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pSharpnessSettings`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlSetCurrentSharpness(
        hDisplayOutput: ctl_display_output_handle_t,
        pSharpnessSettings: *mut ctl_sharpness_settings_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief I2CFlags bitmasks"]
pub type ctl_i2c_flags_t = u32;
#[doc = "< Force Atomic I2C"]
pub const _ctl_i2c_flag_t_CTL_I2C_FLAG_ATOMICI2C: _ctl_i2c_flag_t = 1;
pub const _ctl_i2c_flag_t_CTL_I2C_FLAG_MAX: _ctl_i2c_flag_t = -2147483648;
pub type _ctl_i2c_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_i2c_flag_t as ctl_i2c_flag_t;
#[doc = "\n @brief I2C access arguments"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_i2c_access_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Valid data size"]
    pub DataSize: u32,
    #[doc = "< [in] Adreess to read or write"]
    pub Address: u32,
    #[doc = "< [in] Operation type, 1 for Read, 2 for Write, for Write operation, App\n< needs to run with admin privileges"]
    pub OpType: ctl_operation_type_t,
    #[doc = "< [in] Offset"]
    pub Offset: u32,
    #[doc = "< [in] I2C Flags. Refer ::ctl_i2c_flag_t"]
    pub Flags: ctl_i2c_flags_t,
    #[doc = "< [in] RAD, For Future use, to be used for branch devices, Interface\n< will be provided to get RAD"]
    pub RAD: u64,
    #[doc = "< [in,out] Data array"]
    pub Data: [u8; 128usize],
}
#[test]
fn bindgen_test_layout__ctl_i2c_access_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_i2c_access_args_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_i2c_access_args_t>(),
        168usize,
        concat!("Size of: ", stringify!(_ctl_i2c_access_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_i2c_access_args_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_i2c_access_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DataSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(DataSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Address) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(Address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(OpType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Offset) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(Offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RAD) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(RAD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_i2c_access_args_t),
            "::",
            stringify!(Data)
        )
    );
}
extern "C" {
    #[doc = "\n @brief I2C Access\n\n @details\n     - The application does I2C aceess\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pI2cAccessArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INVALID_OPERATION_TYPE - \"Invalid operation type\"\n     - ::CTL_RESULT_ERROR_INVALID_SIZE - \"Invalid I2C data size\"\n     - ::CTL_RESULT_ERROR_INSUFFICIENT_PERMISSIONS - \"Insufficient permissions\"\n     - ::CTL_RESULT_ERROR_INVALID_NULL_POINTER - \"Invalid null pointer\"\n     - ::CTL_RESULT_ERROR_NULL_OS_DISPLAY_OUTPUT_HANDLE - \"Null OS display output handle\"\n     - ::CTL_RESULT_ERROR_NULL_OS_INTERFACE - \"Null OS interface\"\n     - ::CTL_RESULT_ERROR_NULL_OS_ADAPATER_HANDLE - \"Null OS adapter handle\"\n     - ::CTL_RESULT_ERROR_KMD_CALL - \"Kernal mode driver call failure\""]
    pub fn ctlI2CAccess(
        hDisplayOutput: ctl_display_output_handle_t,
        pI2cAccessArgs: *mut ctl_i2c_access_args_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief AUX Flags bitmasks"]
pub type ctl_aux_flags_t = u32;
#[doc = "< For Native AUX operation"]
pub const _ctl_aux_flag_t_CTL_AUX_FLAG_NATIVE_AUX: _ctl_aux_flag_t = 1;
#[doc = "< For I2C AUX operation"]
pub const _ctl_aux_flag_t_CTL_AUX_FLAG_I2C_AUX: _ctl_aux_flag_t = 2;
#[doc = "< For I2C AUX MOT operation"]
pub const _ctl_aux_flag_t_CTL_AUX_FLAG_I2C_AUX_MOT: _ctl_aux_flag_t = 4;
pub const _ctl_aux_flag_t_CTL_AUX_FLAG_MAX: _ctl_aux_flag_t = -2147483648;
pub type _ctl_aux_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_aux_flag_t as ctl_aux_flag_t;
#[doc = "\n @brief AUX access arguments"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_aux_access_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Operation type, 1 for Read, 2 for Write, for Write operation, App\n< needs to run with admin privileges"]
    pub OpType: ctl_operation_type_t,
    #[doc = "< [in] Aux Flags. Refer ::ctl_aux_flag_t"]
    pub Flags: ctl_aux_flags_t,
    #[doc = "< [in] Adreess to read or write"]
    pub Address: u32,
    #[doc = "< [in] RAD, For Future use, to be used for branch devices, Interface\n< will be provided to get RAD"]
    pub RAD: u64,
    #[doc = "< [in] Port ID, For Future use, to be used for SST tiled devices"]
    pub PortID: u32,
    #[doc = "< [in,out] Valid data size"]
    pub DataSize: u32,
    #[doc = "< [in,out] Data array"]
    pub Data: [u8; 132usize],
}
#[test]
fn bindgen_test_layout__ctl_aux_access_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_aux_access_args_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_aux_access_args_t>(),
        176usize,
        concat!("Size of: ", stringify!(_ctl_aux_access_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_aux_access_args_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_aux_access_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(OpType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(Address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RAD) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(RAD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PortID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(PortID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DataSize) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(DataSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_aux_access_args_t),
            "::",
            stringify!(Data)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Aux Access\n\n @details\n     - The application does Aux aceess, PSR needs to be disabled for AUX\n       call.\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pAuxAccessArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INVALID_OPERATION_TYPE - \"Invalid operation type\"\n     - ::CTL_RESULT_ERROR_INVALID_SIZE - \"Invalid AUX data size\"\n     - ::CTL_RESULT_ERROR_INSUFFICIENT_PERMISSIONS - \"Insufficient permissions\"\n     - ::CTL_RESULT_ERROR_INVALID_NULL_POINTER - \"Invalid null pointer\"\n     - ::CTL_RESULT_ERROR_NULL_OS_DISPLAY_OUTPUT_HANDLE - \"Null OS display output handle\"\n     - ::CTL_RESULT_ERROR_NULL_OS_INTERFACE - \"Null OS interface\"\n     - ::CTL_RESULT_ERROR_NULL_OS_ADAPATER_HANDLE - \"Null OS adapter handle\"\n     - ::CTL_RESULT_ERROR_INVALID_AUX_ACCESS_FLAG - \"Invalid flag for AUX access\"\n     - ::CTL_RESULT_ERROR_KMD_CALL - \"Kernal mode driver call failure\""]
    pub fn ctlAUXAccess(
        hDisplayOutput: ctl_display_output_handle_t,
        pAuxAccessArgs: *mut ctl_aux_access_args_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief Power saving features (Each individual feature's set & get call can be\n        called only once at a time)"]
pub type ctl_power_optimization_flags_t = u32;
#[doc = "< Frame buffer compression"]
pub const _ctl_power_optimization_flag_t_CTL_POWER_OPTIMIZATION_FLAG_FBC:
    _ctl_power_optimization_flag_t = 1;
#[doc = "< Panel self refresh"]
pub const _ctl_power_optimization_flag_t_CTL_POWER_OPTIMIZATION_FLAG_PSR:
    _ctl_power_optimization_flag_t = 2;
#[doc = "< Display power saving technology (Panel technology dependent)"]
pub const _ctl_power_optimization_flag_t_CTL_POWER_OPTIMIZATION_FLAG_DPST:
    _ctl_power_optimization_flag_t = 4;
#[doc = "< Low refresh rate (LRR/ALRR/UBRR), UBRR is supported only for IGCC and\n< NDA clients. UBZRR and UBLRR both can not be enabled at the same time,\n< only one can be enabled at a given time"]
pub const _ctl_power_optimization_flag_t_CTL_POWER_OPTIMIZATION_FLAG_LRR:
    _ctl_power_optimization_flag_t = 8;
pub const _ctl_power_optimization_flag_t_CTL_POWER_OPTIMIZATION_FLAG_MAX:
    _ctl_power_optimization_flag_t = -2147483648;
pub type _ctl_power_optimization_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_power_optimization_flag_t as ctl_power_optimization_flag_t;
#[doc = "\n @brief GPU/Panel/TCON dependent power optimization technology"]
pub type ctl_power_optimization_dpst_flags_t = u32;
#[doc = "< Intel DPST with Backlight control"]
pub const _ctl_power_optimization_dpst_flag_t_CTL_POWER_OPTIMIZATION_DPST_FLAG_BKLT:
    _ctl_power_optimization_dpst_flag_t = 1;
#[doc = "< Panel TCON specific Content Adaptive Control mechanism"]
pub const _ctl_power_optimization_dpst_flag_t_CTL_POWER_OPTIMIZATION_DPST_FLAG_PANEL_CABC:
    _ctl_power_optimization_dpst_flag_t = 2;
#[doc = "< Intel OLED Power Saving Technology"]
pub const _ctl_power_optimization_dpst_flag_t_CTL_POWER_OPTIMIZATION_DPST_FLAG_OPST:
    _ctl_power_optimization_dpst_flag_t = 4;
#[doc = "< TCON based Edge Luminance Profile"]
pub const _ctl_power_optimization_dpst_flag_t_CTL_POWER_OPTIMIZATION_DPST_FLAG_ELP:
    _ctl_power_optimization_dpst_flag_t = 8;
#[doc = "< Extra power saving mode"]
pub const _ctl_power_optimization_dpst_flag_t_CTL_POWER_OPTIMIZATION_DPST_FLAG_EPSM:
    _ctl_power_optimization_dpst_flag_t = 16;
pub const _ctl_power_optimization_dpst_flag_t_CTL_POWER_OPTIMIZATION_DPST_FLAG_MAX:
    _ctl_power_optimization_dpst_flag_t = -2147483648;
pub type _ctl_power_optimization_dpst_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_power_optimization_dpst_flag_t as ctl_power_optimization_dpst_flag_t;
#[doc = "< Power Source AC"]
pub const _ctl_power_source_t_CTL_POWER_SOURCE_AC: _ctl_power_source_t = 0;
#[doc = "< Power Source DC"]
pub const _ctl_power_source_t_CTL_POWER_SOURCE_DC: _ctl_power_source_t = 1;
pub const _ctl_power_source_t_CTL_POWER_SOURCE_MAX: _ctl_power_source_t = 2;
#[doc = "\n @brief Power Source"]
pub type _ctl_power_source_t = ::std::os::raw::c_int;
#[doc = "\n @brief Power Source"]
pub use self::_ctl_power_source_t as ctl_power_source_t;
#[doc = "< Balanced mode"]
pub const _ctl_power_optimization_plan_t_CTL_POWER_OPTIMIZATION_PLAN_BALANCED:
    _ctl_power_optimization_plan_t = 0;
#[doc = "< High Performance Mode"]
pub const _ctl_power_optimization_plan_t_CTL_POWER_OPTIMIZATION_PLAN_HIGH_PERFORMANCE:
    _ctl_power_optimization_plan_t = 1;
#[doc = "< Power Saver Mode"]
pub const _ctl_power_optimization_plan_t_CTL_POWER_OPTIMIZATION_PLAN_POWER_SAVER:
    _ctl_power_optimization_plan_t = 2;
pub const _ctl_power_optimization_plan_t_CTL_POWER_OPTIMIZATION_PLAN_MAX:
    _ctl_power_optimization_plan_t = 3;
#[doc = "\n @brief Power Optimization Plan"]
pub type _ctl_power_optimization_plan_t = ::std::os::raw::c_int;
#[doc = "\n @brief Power Optimization Plan"]
pub use self::_ctl_power_optimization_plan_t as ctl_power_optimization_plan_t;
#[doc = "\n @brief Type of low refresh rate feature"]
pub type ctl_power_optimization_lrr_flags_t = u32;
#[doc = "< LRR 1.0"]
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_LRR10:
    _ctl_power_optimization_lrr_flag_t = 1;
#[doc = "< LRR 2.0"]
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_LRR20:
    _ctl_power_optimization_lrr_flag_t = 2;
#[doc = "< LRR 2.5"]
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_LRR25:
    _ctl_power_optimization_lrr_flag_t = 4;
#[doc = "< Autonomous LRR"]
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_ALRR:
    _ctl_power_optimization_lrr_flag_t = 8;
#[doc = "< User based low refresh rate"]
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_UBLRR:
    _ctl_power_optimization_lrr_flag_t = 16;
#[doc = "< User based zero refresh rate"]
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_UBZRR:
    _ctl_power_optimization_lrr_flag_t = 32;
pub const _ctl_power_optimization_lrr_flag_t_CTL_POWER_OPTIMIZATION_LRR_FLAG_MAX:
    _ctl_power_optimization_lrr_flag_t = -2147483648;
pub type _ctl_power_optimization_lrr_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_power_optimization_lrr_flag_t as ctl_power_optimization_lrr_flag_t;
#[doc = "\n @brief Power optimization caps"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_power_optimization_caps_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] Supported power optimization features. Refer\n< ::ctl_power_optimization_flag_t"]
    pub SupportedFeatures: ctl_power_optimization_flags_t,
}
#[test]
fn bindgen_test_layout__ctl_power_optimization_caps_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_power_optimization_caps_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_power_optimization_caps_t>(),
        12usize,
        concat!("Size of: ", stringify!(_ctl_power_optimization_caps_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_power_optimization_caps_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_power_optimization_caps_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_caps_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_caps_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedFeatures) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_caps_t),
            "::",
            stringify!(SupportedFeatures)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Get Power optimization features\n\n @details\n     - Returns power optimization capabilities\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pPowerOptimizationCaps`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\""]
    pub fn ctlGetPowerOptimizationCaps(
        hDisplayOutput: ctl_display_output_handle_t,
        pPowerOptimizationCaps: *mut ctl_power_optimization_caps_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief LRR detailed settings"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_power_optimization_lrr_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] LRR type(s). Refer ::ctl_power_optimization_lrr_flag_t"]
    pub SupportedLRRTypes: ctl_power_optimization_lrr_flags_t,
    #[doc = "< [in,out] Current enabled LRR type(s) or the LRR type(s) to set to.\n< Refer ::ctl_power_optimization_lrr_flag_t"]
    pub CurrentLRRTypes: ctl_power_optimization_lrr_flags_t,
    #[doc = "< [out] Require PSR disable for any change in the selected LRR feature.\n< Caller can re-enable PSR once the respective LRR feature is\n< enable/disabled. E.g. for UBRR based on platform this flag may not be\n< set in which case caller doesn't need to do an explicit PSR disable"]
    pub bRequirePSRDisable: bool,
    #[doc = "< [out] Lowest RR used for LRR functionality if known to source"]
    pub LowRR: u16,
}
#[test]
fn bindgen_test_layout__ctl_power_optimization_lrr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_power_optimization_lrr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_power_optimization_lrr_t>(),
        20usize,
        concat!("Size of: ", stringify!(_ctl_power_optimization_lrr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_power_optimization_lrr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_power_optimization_lrr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_lrr_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_lrr_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedLRRTypes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_lrr_t),
            "::",
            stringify!(SupportedLRRTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentLRRTypes) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_lrr_t),
            "::",
            stringify!(CurrentLRRTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bRequirePSRDisable) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_lrr_t),
            "::",
            stringify!(bRequirePSRDisable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LowRR) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_lrr_t),
            "::",
            stringify!(LowRR)
        )
    );
}
#[doc = "\n @brief PSR detailed settings"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_power_optimization_psr_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] A value of 1 means PSR1, 2 means PSR2"]
    pub PSRVersion: u8,
    #[doc = "< [in,out] Full fetch and update"]
    pub FullFetchUpdate: bool,
}
#[test]
fn bindgen_test_layout__ctl_power_optimization_psr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_power_optimization_psr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_power_optimization_psr_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ctl_power_optimization_psr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_power_optimization_psr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_power_optimization_psr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_psr_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_psr_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSRVersion) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_psr_t),
            "::",
            stringify!(PSRVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FullFetchUpdate) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_psr_t),
            "::",
            stringify!(FullFetchUpdate)
        )
    );
}
#[doc = "\n @brief DPST detailed settings"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_power_optimization_dpst_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] Minimum supported aggressiveness level"]
    pub MinLevel: u8,
    #[doc = "< [out] Maximum supported aggressiveness level"]
    pub MaxLevel: u8,
    #[doc = "< [in,out] Current aggressiveness level to be set"]
    pub Level: u8,
    #[doc = "< [out] Supported features"]
    pub SupportedFeatures: ctl_power_optimization_dpst_flags_t,
    #[doc = "< [in,out] Features enabled or to be enabled"]
    pub EnabledFeatures: ctl_power_optimization_dpst_flags_t,
}
#[test]
fn bindgen_test_layout__ctl_power_optimization_dpst_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_power_optimization_dpst_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_power_optimization_dpst_t>(),
        16usize,
        concat!("Size of: ", stringify!(_ctl_power_optimization_dpst_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_power_optimization_dpst_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_power_optimization_dpst_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinLevel) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(MinLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxLevel) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(MaxLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Level) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(Level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedFeatures) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(SupportedFeatures)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnabledFeatures) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_dpst_t),
            "::",
            stringify!(EnabledFeatures)
        )
    );
}
#[doc = "\n @brief Feature specific power optimization data"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ctl_power_optimization_feature_specific_info_t {
    #[doc = "< [out] LRR info"]
    pub LRRInfo: ctl_power_optimization_lrr_t,
    #[doc = "< [in,out] PSR info"]
    pub PSRInfo: ctl_power_optimization_psr_t,
    #[doc = "< [in,out] DPST info"]
    pub DPSTInfo: ctl_power_optimization_dpst_t,
}
#[test]
fn bindgen_test_layout__ctl_power_optimization_feature_specific_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_power_optimization_feature_specific_info_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_power_optimization_feature_specific_info_t>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(_ctl_power_optimization_feature_specific_info_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_power_optimization_feature_specific_info_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_power_optimization_feature_specific_info_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LRRInfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_feature_specific_info_t),
            "::",
            stringify!(LRRInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSRInfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_feature_specific_info_t),
            "::",
            stringify!(PSRInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DPSTInfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_feature_specific_info_t),
            "::",
            stringify!(DPSTInfo)
        )
    );
}
#[doc = "\n @brief Feature specific power optimization data"]
pub type ctl_power_optimization_feature_specific_info_t =
    _ctl_power_optimization_feature_specific_info_t;
#[doc = "\n @brief Power optimization settings"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ctl_power_optimization_settings_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Power optimization power plan (max power/max perf/balanced)"]
    pub PowerOptimizationPlan: ctl_power_optimization_plan_t,
    #[doc = "< [in] Power optimization feature interested in. Refer\n< ::ctl_power_optimization_flag_t"]
    pub PowerOptimizationFeature: ctl_power_optimization_flags_t,
    #[doc = "< [in,out] Enable state"]
    pub Enable: bool,
    #[doc = "< [in,out] Data specific to the feature caller is interested in"]
    pub FeatureSpecificData: ctl_power_optimization_feature_specific_info_t,
    #[doc = "< [in] AC/DC"]
    pub PowerSource: ctl_power_source_t,
}
#[test]
fn bindgen_test_layout__ctl_power_optimization_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_power_optimization_settings_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_power_optimization_settings_t>(),
        44usize,
        concat!("Size of: ", stringify!(_ctl_power_optimization_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_power_optimization_settings_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_power_optimization_settings_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PowerOptimizationPlan) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(PowerOptimizationPlan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PowerOptimizationFeature) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(PowerOptimizationFeature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enable) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureSpecificData) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(FeatureSpecificData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PowerSource) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_power_optimization_settings_t),
            "::",
            stringify!(PowerSource)
        )
    );
}
#[doc = "\n @brief Brightness settings for SET call"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_set_brightness_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] The brightness level that the display need to transitioning to in\n< milli-percentage. Range is 0-100000 (100%)"]
    pub TargetBrightness: u32,
    #[doc = "< [in] Transition Time for brightness to take effect in milli-seconds.\n< If its 0 then it will be an immediate change. Maximum possible value\n< is 1000ms."]
    pub SmoothTransitionTimeInMs: u32,
    #[doc = "< [in] Reserved for future use"]
    pub ReservedFields: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__ctl_set_brightness_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_set_brightness_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_set_brightness_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_set_brightness_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_set_brightness_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_set_brightness_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_set_brightness_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_set_brightness_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TargetBrightness) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_set_brightness_t),
            "::",
            stringify!(TargetBrightness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SmoothTransitionTimeInMs) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_set_brightness_t),
            "::",
            stringify!(SmoothTransitionTimeInMs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFields) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_set_brightness_t),
            "::",
            stringify!(ReservedFields)
        )
    );
}
#[doc = "\n @brief Brightness settings for GET call"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_get_brightness_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] The brightness level that the display is currently transitioning\n< to in milli-percentage. If not in a transition, this should equal the\n< current brightness. Range is 0-100000 (100%)"]
    pub TargetBrightness: u32,
    #[doc = "< [out] The current brightness level of the display in milli-percentage"]
    pub CurrentBrightness: u32,
    #[doc = "< [out] Reserved for future use"]
    pub ReservedFields: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__ctl_get_brightness_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_get_brightness_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_get_brightness_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_get_brightness_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_get_brightness_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ctl_get_brightness_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_get_brightness_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_get_brightness_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TargetBrightness) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_get_brightness_t),
            "::",
            stringify!(TargetBrightness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentBrightness) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_get_brightness_t),
            "::",
            stringify!(CurrentBrightness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReservedFields) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_get_brightness_t),
            "::",
            stringify!(ReservedFields)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Get Power optimization setting\n\n @details\n     - Returns power optimization setting for a specific feature\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pPowerOptimizationSettings`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INVALID_POWERFEATURE_OPTIMIZATION_FLAG - \"Unsupported PowerOptimizationFeature\"\n     - ::CTL_RESULT_ERROR_INVALID_POWERSOURCE_TYPE_FOR_DPST - \"DPST is supported only in DC Mode\""]
    pub fn ctlGetPowerOptimizationSetting(
        hDisplayOutput: ctl_display_output_handle_t,
        pPowerOptimizationSettings: *mut ctl_power_optimization_settings_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Set Power optimization setting\n\n @details\n     - Set power optimization setting for a specific feature\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pPowerOptimizationSettings`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INVALID_POWERFEATURE_OPTIMIZATION_FLAG - \"Unsupported PowerOptimizationFeature\"\n     - ::CTL_RESULT_ERROR_INVALID_POWERSOURCE_TYPE_FOR_DPST - \"DPST is supported only in DC Mode\""]
    pub fn ctlSetPowerOptimizationSetting(
        hDisplayOutput: ctl_display_output_handle_t,
        pPowerOptimizationSettings: *mut ctl_power_optimization_settings_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Set Brightness on companion display\n\n @details\n     - Set Brightness for a target display. Currently support is only for\n       companion display.\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pSetBrightnessSetting`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INVALID_ARGUMENT - \"Invalid Brightness data passed as argument\"\n     - ::CTL_RESULT_ERROR_DISPLAY_NOT_ACTIVE - \"Display not active\"\n     - ::CTL_RESULT_ERROR_INVALID_OPERATION_TYPE - \"Currently Brightness API is supported only on companion display\""]
    pub fn ctlSetBrightnessSetting(
        hDisplayOutput: ctl_display_output_handle_t,
        pSetBrightnessSetting: *mut ctl_set_brightness_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Get Brightness setting\n\n @details\n     - Get Brightness for a target display. Currently support is only for\n       companion display.\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pGetBrightnessSetting`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_DISPLAY_NOT_ACTIVE - \"Display not active\"\n     - ::CTL_RESULT_ERROR_INVALID_OPERATION_TYPE - \"Currently Brightness API is supported only on companion display\""]
    pub fn ctlGetBrightnessSetting(
        hDisplayOutput: ctl_display_output_handle_t,
        pGetBrightnessSetting: *mut ctl_get_brightness_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief Pixtx pipe set configuration flags bitmasks"]
pub type ctl_pixtx_pipe_set_config_flags_t = u32;
#[doc = "< For maintaining persistance across power events"]
pub const _ctl_pixtx_pipe_set_config_flag_t_CTL_PIXTX_PIPE_SET_CONFIG_FLAG_PERSIST_ACROSS_POWER_EVENTS : _ctl_pixtx_pipe_set_config_flag_t = 1 ;
pub const _ctl_pixtx_pipe_set_config_flag_t_CTL_PIXTX_PIPE_SET_CONFIG_FLAG_MAX:
    _ctl_pixtx_pipe_set_config_flag_t = -2147483648;
pub type _ctl_pixtx_pipe_set_config_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_pixtx_pipe_set_config_flag_t as ctl_pixtx_pipe_set_config_flag_t;
#[doc = "< Block type 1D LUT"]
pub const _ctl_pixtx_block_type_t_CTL_PIXTX_BLOCK_TYPE_1D_LUT: _ctl_pixtx_block_type_t = 1;
#[doc = "< Block type 3D LUT"]
pub const _ctl_pixtx_block_type_t_CTL_PIXTX_BLOCK_TYPE_3D_LUT: _ctl_pixtx_block_type_t = 2;
#[doc = "< Block type 3x3 matrix"]
pub const _ctl_pixtx_block_type_t_CTL_PIXTX_BLOCK_TYPE_3X3_MATRIX: _ctl_pixtx_block_type_t = 3;
#[doc = "< Block type 3x3 matrix and offsets"]
pub const _ctl_pixtx_block_type_t_CTL_PIXTX_BLOCK_TYPE_3X3_MATRIX_AND_OFFSETS:
    _ctl_pixtx_block_type_t = 4;
pub const _ctl_pixtx_block_type_t_CTL_PIXTX_BLOCK_TYPE_MAX: _ctl_pixtx_block_type_t = 5;
#[doc = "\n @brief Pixel transformation block types"]
pub type _ctl_pixtx_block_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Pixel transformation block types"]
pub use self::_ctl_pixtx_block_type_t as ctl_pixtx_block_type_t;
#[doc = "< Uniform LUT sampling"]
pub const _ctl_pixtx_lut_sampling_type_t_CTL_PIXTX_LUT_SAMPLING_TYPE_UNIFORM:
    _ctl_pixtx_lut_sampling_type_t = 0;
#[doc = "< Non uniform LUT sampling, Required mainly in HDR mode"]
pub const _ctl_pixtx_lut_sampling_type_t_CTL_PIXTX_LUT_SAMPLING_TYPE_NONUNIFORM:
    _ctl_pixtx_lut_sampling_type_t = 1;
pub const _ctl_pixtx_lut_sampling_type_t_CTL_PIXTX_LUT_SAMPLING_TYPE_MAX:
    _ctl_pixtx_lut_sampling_type_t = 2;
#[doc = "\n @brief Pixel transformation LUT sampling types"]
pub type _ctl_pixtx_lut_sampling_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Pixel transformation LUT sampling types"]
pub use self::_ctl_pixtx_lut_sampling_type_t as ctl_pixtx_lut_sampling_type_t;
#[doc = "< Get complete pixel processing pipeline capability"]
pub const _ctl_pixtx_config_query_type_t_CTL_PIXTX_CONFIG_QUERY_TYPE_CAPABILITY:
    _ctl_pixtx_config_query_type_t = 0;
#[doc = "< Get the configuration set through last set call"]
pub const _ctl_pixtx_config_query_type_t_CTL_PIXTX_CONFIG_QUERY_TYPE_CURRENT:
    _ctl_pixtx_config_query_type_t = 1;
pub const _ctl_pixtx_config_query_type_t_CTL_PIXTX_CONFIG_QUERY_TYPE_MAX:
    _ctl_pixtx_config_query_type_t = 2;
#[doc = "\n @brief Configuration query types"]
pub type _ctl_pixtx_config_query_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Configuration query types"]
pub use self::_ctl_pixtx_config_query_type_t as ctl_pixtx_config_query_type_t;
#[doc = "< Restore block by block or entire pipe line. Use NumBlocks = 0 to\n< restore all."]
pub const _ctl_pixtx_config_opertaion_type_t_CTL_PIXTX_CONFIG_OPERTAION_TYPE_RESTORE_DEFAULT:
    _ctl_pixtx_config_opertaion_type_t = 1;
#[doc = "< Custom LUT or matrix can be set thorugh this option."]
pub const _ctl_pixtx_config_opertaion_type_t_CTL_PIXTX_CONFIG_OPERTAION_TYPE_SET_CUSTOM:
    _ctl_pixtx_config_opertaion_type_t = 2;
pub const _ctl_pixtx_config_opertaion_type_t_CTL_PIXTX_CONFIG_OPERTAION_TYPE_MAX:
    _ctl_pixtx_config_opertaion_type_t = 3;
#[doc = "\n @brief Configuration operation types"]
pub type _ctl_pixtx_config_opertaion_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Configuration operation types"]
pub use self::_ctl_pixtx_config_opertaion_type_t as ctl_pixtx_config_opertaion_type_t;
#[doc = "< Gamma encoding SRGB"]
pub const _ctl_pixtx_gamma_encoding_type_t_CTL_PIXTX_GAMMA_ENCODING_TYPE_SRGB:
    _ctl_pixtx_gamma_encoding_type_t = 0;
#[doc = "< Gamma encoding REC709, Applicable for REC2020 as well"]
pub const _ctl_pixtx_gamma_encoding_type_t_CTL_PIXTX_GAMMA_ENCODING_TYPE_REC709:
    _ctl_pixtx_gamma_encoding_type_t = 1;
#[doc = "< Gamma encoding ST2084"]
pub const _ctl_pixtx_gamma_encoding_type_t_CTL_PIXTX_GAMMA_ENCODING_TYPE_ST2084:
    _ctl_pixtx_gamma_encoding_type_t = 2;
#[doc = "< Gamma encoding HLG"]
pub const _ctl_pixtx_gamma_encoding_type_t_CTL_PIXTX_GAMMA_ENCODING_TYPE_HLG:
    _ctl_pixtx_gamma_encoding_type_t = 3;
#[doc = "< Gamma encoding linear"]
pub const _ctl_pixtx_gamma_encoding_type_t_CTL_PIXTX_GAMMA_ENCODING_TYPE_LINEAR:
    _ctl_pixtx_gamma_encoding_type_t = 4;
pub const _ctl_pixtx_gamma_encoding_type_t_CTL_PIXTX_GAMMA_ENCODING_TYPE_MAX:
    _ctl_pixtx_gamma_encoding_type_t = 5;
#[doc = "\n @brief Pixel transformation gamma encoding types"]
pub type _ctl_pixtx_gamma_encoding_type_t = ::std::os::raw::c_int;
#[doc = "\n @brief Pixel transformation gamma encoding types"]
pub use self::_ctl_pixtx_gamma_encoding_type_t as ctl_pixtx_gamma_encoding_type_t;
#[doc = "< Color space REC709"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_REC709: _ctl_pixtx_color_space_t = 0;
#[doc = "< Color space REC2020"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_REC2020: _ctl_pixtx_color_space_t = 1;
#[doc = "< Color space AdobeRGB"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_ADOBE_RGB: _ctl_pixtx_color_space_t = 2;
#[doc = "< Color space P3_D65"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_P3_D65: _ctl_pixtx_color_space_t = 3;
#[doc = "< Color space P3_DCI"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_P3_DCI: _ctl_pixtx_color_space_t = 4;
#[doc = "< Color space P3_D60"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_P3_D60: _ctl_pixtx_color_space_t = 5;
#[doc = "< Color space custom, Refer ::ctl_pixtx_color_primaries_t for color\n< primary details"]
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_CUSTOM: _ctl_pixtx_color_space_t = 65535;
pub const _ctl_pixtx_color_space_t_CTL_PIXTX_COLOR_SPACE_MAX: _ctl_pixtx_color_space_t = 65536;
#[doc = "\n @brief Pixel transformation color space types"]
pub type _ctl_pixtx_color_space_t = ::std::os::raw::c_int;
#[doc = "\n @brief Pixel transformation color space types"]
pub use self::_ctl_pixtx_color_space_t as ctl_pixtx_color_space_t;
#[doc = "< Color model RGB full range"]
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_RGB_FR: _ctl_pixtx_color_model_t = 0;
#[doc = "< Color model RGB limited range"]
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_RGB_LR: _ctl_pixtx_color_model_t = 1;
#[doc = "< Color model YCBCR 422 full range"]
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_YCBCR_422_FR: _ctl_pixtx_color_model_t = 2;
#[doc = "< Color model YCBCR 422 limited range"]
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_YCBCR_422_LR: _ctl_pixtx_color_model_t = 3;
#[doc = "< Color model YCBCR 420 full range"]
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_YCBCR_420_FR: _ctl_pixtx_color_model_t = 4;
#[doc = "< Color model YCBCR 420 limited range"]
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_YCBCR_420_LR: _ctl_pixtx_color_model_t = 5;
pub const _ctl_pixtx_color_model_t_CTL_PIXTX_COLOR_MODEL_MAX: _ctl_pixtx_color_model_t = 6;
#[doc = "\n @brief Pixel transformation color model types"]
pub type _ctl_pixtx_color_model_t = ::std::os::raw::c_int;
#[doc = "\n @brief Pixel transformation color model types"]
pub use self::_ctl_pixtx_color_model_t as ctl_pixtx_color_model_t;
#[doc = "\n @brief Pixel transformation color primaries"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_color_primaries_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] CIE1931 x value with maximum red pixel value"]
    pub xR: f64,
    #[doc = "< [out] CIE1931 y value with maximum red pixel value"]
    pub yR: f64,
    #[doc = "< [out] CIE1931 x value with maximum green pixel value"]
    pub xG: f64,
    #[doc = "< [out] CIE1931 y value with maximum green pixel value"]
    pub yG: f64,
    #[doc = "< [out] CIE1931 x value with maximum blue pixel value"]
    pub xB: f64,
    #[doc = "< [out] CIE1931 y value with maximum blue pixel value"]
    pub yB: f64,
    #[doc = "< [out] CIE1931 x value with maximum white pixel value"]
    pub xW: f64,
    #[doc = "< [out] CIE1931 y value with maximum white pixel value"]
    pub yW: f64,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_color_primaries_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_color_primaries_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_color_primaries_t>(),
        72usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_color_primaries_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_color_primaries_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_color_primaries_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(xR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(yR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xG) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(xG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yG) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(yG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xB) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(xB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yB) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(yB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xW) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(xW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yW) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_color_primaries_t),
            "::",
            stringify!(yW)
        )
    );
}
#[doc = "\n @brief Pixel transformation pixel format"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_pixel_format_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [out] Bits per color, It Will be 16 for FP16 case"]
    pub BitsPerColor: u32,
    #[doc = "< [out] Will be set for FP16 or other floating point encoding schemes"]
    pub IsFloat: bool,
    #[doc = "< [out] Encoding type"]
    pub EncodingType: ctl_pixtx_gamma_encoding_type_t,
    #[doc = "< [out] Color space"]
    pub ColorSpace: ctl_pixtx_color_space_t,
    #[doc = "< [out] Color model"]
    pub ColorModel: ctl_pixtx_color_model_t,
    #[doc = "< [out] Color primaries, Used mainly for custom color space"]
    pub ColorPrimaries: ctl_pixtx_color_primaries_t,
    #[doc = "< [out] Maximum brightness of pixel values. If no input is given,\n< default will be set to sRGB during set call. If panel capability is\n< not known get call will default to sRGB."]
    pub MaxBrightness: f64,
    #[doc = "< [out] Minimum brightness of pixel values"]
    pub MinBrightness: f64,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_pixel_format_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_pixel_format_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_pixel_format_t>(),
        120usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_pixel_format_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_pixel_format_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_pixel_format_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BitsPerColor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(BitsPerColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsFloat) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(IsFloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EncodingType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(EncodingType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorSpace) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(ColorSpace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorModel) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(ColorModel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorPrimaries) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(ColorPrimaries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxBrightness) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(MaxBrightness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinBrightness) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pixel_format_t),
            "::",
            stringify!(MinBrightness)
        )
    );
}
#[doc = "\n @brief Pixel transformation 1D LUT configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_1dlut_config_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Blocks with non-uniform sampling capability support unifrom\n< sampling also but not vice versa."]
    pub SamplingType: ctl_pixtx_lut_sampling_type_t,
    #[doc = "< [in,out] Number of samples per channel. Resampled internally based on\n< HW capability for uniformly sampled LUT.Maximum supported value is\n< MAX_NUM_SAMPLES_PER_CHANNEL_1D_LUT Caller needs to use exact sampling\n< position given in pSamplePositions for non-uniformly sampled LUTs."]
    pub NumSamplesPerChannel: u32,
    #[doc = "< [in,out] Number of channels, 1 for Grey scale LUT, 3 for RGB LUT"]
    pub NumChannels: u32,
    #[doc = "< [in,out] Pointer to sample values, R array followed by G and B arrays\n< in case of multi-channel LUT. Allocation size for pSampleValues should\n< be NumSamplesPerChannel * NumChannels * sizeof(double)"]
    pub pSampleValues: *mut f64,
    #[doc = "< [out] LUT (same for all channels) to represent sampling positions for\n< non-uniformly sampled LUTs.Can be NULL in case uniformly sampled LUTs"]
    pub pSamplePositions: *mut f64,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_1dlut_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_1dlut_config_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_1dlut_config_t>(),
        40usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_1dlut_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_1dlut_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_1dlut_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SamplingType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(SamplingType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumSamplesPerChannel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(NumSamplesPerChannel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumChannels) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(NumChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pSampleValues) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(pSampleValues)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pSamplePositions) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_1dlut_config_t),
            "::",
            stringify!(pSamplePositions)
        )
    );
}
#[doc = "\n @brief Pixel transformation matrix configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_matrix_config_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Pre offsets"]
    pub PreOffsets: [f64; 3usize],
    #[doc = "< [in,out] Post offsets"]
    pub PostOffsets: [f64; 3usize],
    #[doc = "< [in,out] 3x3 Matrix"]
    pub Matrix: [[f64; 3usize]; 3usize],
}
#[test]
fn bindgen_test_layout__ctl_pixtx_matrix_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_matrix_config_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_matrix_config_t>(),
        128usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_matrix_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_matrix_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_matrix_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_matrix_config_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_matrix_config_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreOffsets) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_matrix_config_t),
            "::",
            stringify!(PreOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PostOffsets) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_matrix_config_t),
            "::",
            stringify!(PostOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Matrix) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_matrix_config_t),
            "::",
            stringify!(Matrix)
        )
    );
}
#[doc = "\n @brief Pixel transformation 3D LUT sample. Samples are converted to integer\n        based on underlying HW capabilities. Hence slight precision loss will\n        be observed while getting sample values."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_3dlut_sample_t {
    #[doc = "< [in,out] Red output value"]
    pub Red: f64,
    #[doc = "< [in,out] Green output value"]
    pub Green: f64,
    #[doc = "< [in,out] Blue output value"]
    pub Blue: f64,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_3dlut_sample_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_3dlut_sample_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_3dlut_sample_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_3dlut_sample_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_3dlut_sample_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_3dlut_sample_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Red) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_sample_t),
            "::",
            stringify!(Red)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Green) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_sample_t),
            "::",
            stringify!(Green)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Blue) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_sample_t),
            "::",
            stringify!(Blue)
        )
    );
}
#[doc = "\n @brief Pixel transformation 3D LUT configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_3dlut_config_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Number of samples per channel"]
    pub NumSamplesPerChannel: u32,
    #[doc = "< [in,out] Pointer to sample values, R in outer most loop followed by G\n< and B"]
    pub pSampleValues: *mut ctl_pixtx_3dlut_sample_t,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_3dlut_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_3dlut_config_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_3dlut_config_t>(),
        24usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_3dlut_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_3dlut_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_3dlut_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_config_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_config_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumSamplesPerChannel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_config_t),
            "::",
            stringify!(NumSamplesPerChannel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pSampleValues) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_3dlut_config_t),
            "::",
            stringify!(pSampleValues)
        )
    );
}
#[doc = "\n @brief Pixel transformation configuration"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ctl_pixtx_config_t {
    #[doc = "< [in,out] 1D LUT configuration"]
    pub OneDLutConfig: ctl_pixtx_1dlut_config_t,
    #[doc = "< [in,out] 3D LUT configuration"]
    pub ThreeDLutConfig: ctl_pixtx_3dlut_config_t,
    #[doc = "< [in,out] Matrix configuration"]
    pub MatrixConfig: ctl_pixtx_matrix_config_t,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_config_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_config_t>(),
        128usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OneDLutConfig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_config_t),
            "::",
            stringify!(OneDLutConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ThreeDLutConfig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_config_t),
            "::",
            stringify!(ThreeDLutConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MatrixConfig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_config_t),
            "::",
            stringify!(MatrixConfig)
        )
    );
}
#[doc = "\n @brief Pixel transformation configuration"]
pub type ctl_pixtx_config_t = _ctl_pixtx_config_t;
#[doc = "\n @brief Pixel transformation block configuration"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ctl_pixtx_block_config_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in,out] Unique ID for each pixel processing block. Id for a block is\n< fixed for a platform."]
    pub BlockId: u32,
    #[doc = "< [in,out] Block type"]
    pub BlockType: ctl_pixtx_block_type_t,
    #[doc = "< [in,out] Configuration"]
    pub Config: ctl_pixtx_config_t,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_block_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_block_config_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_block_config_t>(),
        144usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_block_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_block_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_block_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_block_config_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_block_config_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BlockId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_block_config_t),
            "::",
            stringify!(BlockId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BlockType) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_block_config_t),
            "::",
            stringify!(BlockType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Config) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_block_config_t),
            "::",
            stringify!(Config)
        )
    );
}
#[doc = "\n @brief Pixel transformation pipe get configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_pipe_get_config_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Query operation type"]
    pub QueryType: ctl_pixtx_config_query_type_t,
    #[doc = "< [out] Input pixel format"]
    pub InputPixelFormat: ctl_pixtx_pixel_format_t,
    #[doc = "< [out] Output pixel format"]
    pub OutputPixelFormat: ctl_pixtx_pixel_format_t,
    #[doc = "< [out] Number of blocks"]
    pub NumBlocks: u32,
    #[doc = "< [out] Pointer to specific configs"]
    pub pBlockConfigs: *mut ctl_pixtx_block_config_t,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_pipe_get_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_pipe_get_config_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_pipe_get_config_t>(),
        272usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_pipe_get_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_pipe_get_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_pipe_get_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(QueryType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InputPixelFormat) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(InputPixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OutputPixelFormat) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(OutputPixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumBlocks) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(NumBlocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBlockConfigs) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_get_config_t),
            "::",
            stringify!(pBlockConfigs)
        )
    );
}
#[doc = "\n @brief Pixel transformation pipe set configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_pixtx_pipe_set_config_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Set operation type"]
    pub OpertaionType: ctl_pixtx_config_opertaion_type_t,
    #[doc = "< [in] Config flags. Refer ::ctl_pixtx_pipe_set_config_flag_t"]
    pub Flags: ctl_pixtx_pipe_set_config_flags_t,
    #[doc = "< [in] Number of blocks"]
    pub NumBlocks: u32,
    #[doc = "< [in,out] Array of block specific configs"]
    pub pBlockConfigs: *mut ctl_pixtx_block_config_t,
}
#[test]
fn bindgen_test_layout__ctl_pixtx_pipe_set_config_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_pixtx_pipe_set_config_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_pixtx_pipe_set_config_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_pixtx_pipe_set_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_pixtx_pipe_set_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_ctl_pixtx_pipe_set_config_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_set_config_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_set_config_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpertaionType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_set_config_t),
            "::",
            stringify!(OpertaionType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_set_config_t),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumBlocks) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_set_config_t),
            "::",
            stringify!(NumBlocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBlockConfigs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_pixtx_pipe_set_config_t),
            "::",
            stringify!(pBlockConfigs)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Pixel transformation get pipe configuration\n\n @details\n     - The application does pixel transformation get pipe configuration\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pPixTxGetConfigArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INSUFFICIENT_PERMISSIONS - \"Insufficient permissions\"\n     - ::CTL_RESULT_ERROR_INVALID_NULL_POINTER - \"Invalid null pointer\"\n     - ::CTL_RESULT_ERROR_NULL_OS_DISPLAY_OUTPUT_HANDLE - \"Null OS display output handle\"\n     - ::CTL_RESULT_ERROR_NULL_OS_INTERFACE - \"Null OS interface\"\n     - ::CTL_RESULT_ERROR_NULL_OS_ADAPATER_HANDLE - \"Null OS adapter handle\"\n     - ::CTL_RESULT_ERROR_KMD_CALL - \"Kernal mode driver call failure\"\n     - ::CTL_RESULT_ERROR_INVALID_PIXTX_GET_CONFIG_QUERY_TYPE - \"Invalid query type\"\n     - ::CTL_RESULT_ERROR_INVALID_PIXTX_BLOCK_ID - \"Invalid block id\"\n     - ::CTL_RESULT_ERROR_INSUFFICIENT_PIXTX_BLOCK_CONFIG_MEMORY - \"Insufficient memery allocated for BlockConfigs\"\n     - ::CTL_RESULT_ERROR_3DLUT_INVALID_PIPE - \"Invalid pipe for 3dlut\"\n     - ::CTL_RESULT_ERROR_3DLUT_INVALID_DATA - \"Invalid 3dlut data\"\n     - ::CTL_RESULT_ERROR_3DLUT_NOT_SUPPORTED_IN_HDR - \"3dlut not supported in HDR\"\n     - ::CTL_RESULT_ERROR_3DLUT_INVALID_OPERATION - \"Invalid 3dlut operation\"\n     - ::CTL_RESULT_ERROR_3DLUT_UNSUCCESSFUL - \"3dlut call unsuccessful\""]
    pub fn ctlPixelTransformationGetConfig(
        hDisplayOutput: ctl_display_output_handle_t,
        pPixTxGetConfigArgs: *mut ctl_pixtx_pipe_get_config_t,
    ) -> ctl_result_t;
}
extern "C" {
    #[doc = "\n @brief Pixel transformation set pipe configuration\n\n @details\n     - The application does pixel transformation set pipe configuration\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pPixTxSetConfigArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INSUFFICIENT_PERMISSIONS - \"Insufficient permissions\"\n     - ::CTL_RESULT_ERROR_INVALID_NULL_POINTER - \"Invalid null pointer\"\n     - ::CTL_RESULT_ERROR_NULL_OS_DISPLAY_OUTPUT_HANDLE - \"Null OS display output handle\"\n     - ::CTL_RESULT_ERROR_NULL_OS_INTERFACE - \"Null OS interface\"\n     - ::CTL_RESULT_ERROR_NULL_OS_ADAPATER_HANDLE - \"Null OS adapter handle\"\n     - ::CTL_RESULT_ERROR_KMD_CALL - \"Kernal mode driver call failure\"\n     - ::CTL_RESULT_ERROR_INVALID_PIXTX_SET_CONFIG_OPERATION_TYPE - \"Invalid operation type\"\n     - ::CTL_RESULT_ERROR_INVALID_SET_CONFIG_NUMBER_OF_SAMPLES - \"Invalid number of samples\"\n     - ::CTL_RESULT_ERROR_INVALID_PIXTX_BLOCK_ID - \"Invalid block id\"\n     - ::CTL_RESULT_ERROR_PERSISTANCE_NOT_SUPPORTED - \"Persistance not supported\"\n     - ::CTL_RESULT_ERROR_3DLUT_INVALID_PIPE - \"Invalid pipe for 3dlut\"\n     - ::CTL_RESULT_ERROR_3DLUT_INVALID_DATA - \"Invalid 3dlut data\"\n     - ::CTL_RESULT_ERROR_3DLUT_NOT_SUPPORTED_IN_HDR - \"3dlut not supported in HDR\"\n     - ::CTL_RESULT_ERROR_3DLUT_INVALID_OPERATION - \"Invalid 3dlut operation\"\n     - ::CTL_RESULT_ERROR_3DLUT_UNSUCCESSFUL - \"3dlut call unsuccessful\""]
    pub fn ctlPixelTransformationSetConfig(
        hDisplayOutput: ctl_display_output_handle_t,
        pPixTxSetConfigArgs: *mut ctl_pixtx_pipe_set_config_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief Panel descriptor access arguments"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_panel_descriptor_access_args_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in] Operation type, 1 for Read, 2 for Write. App needs to run with\n< admin privileges for Write operation, Currently only Read operation is\n< supported"]
    pub OpType: ctl_operation_type_t,
    #[doc = "< [in] Block number, Need to provide only if acccessing EDID"]
    pub BlockNumber: u32,
    #[doc = "< [in] Descriptor data size, Should be 0 for querying the size and\n< should be DescriptorDataSize derived from query call otherwise"]
    pub DescriptorDataSize: u32,
    #[doc = "< [in,out] Panel descriptor data"]
    pub pDescriptorData: *mut u8,
}
#[test]
fn bindgen_test_layout__ctl_panel_descriptor_access_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ctl_panel_descriptor_access_args_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ctl_panel_descriptor_access_args_t>(),
        32usize,
        concat!("Size of: ", stringify!(_ctl_panel_descriptor_access_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ctl_panel_descriptor_access_args_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_ctl_panel_descriptor_access_args_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_panel_descriptor_access_args_t),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_panel_descriptor_access_args_t),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_panel_descriptor_access_args_t),
            "::",
            stringify!(OpType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BlockNumber) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_panel_descriptor_access_args_t),
            "::",
            stringify!(BlockNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DescriptorDataSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_panel_descriptor_access_args_t),
            "::",
            stringify!(DescriptorDataSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDescriptorData) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ctl_panel_descriptor_access_args_t),
            "::",
            stringify!(pDescriptorData)
        )
    );
}
extern "C" {
    #[doc = "\n @brief Panel Descriptor Access\n\n @details\n     - The application does EDID or Display ID access\n\n @returns\n     - CTL_RESULT_SUCCESS\n     - CTL_RESULT_ERROR_UNINITIALIZED\n     - CTL_RESULT_ERROR_DEVICE_LOST\n     - CTL_RESULT_ERROR_INVALID_NULL_HANDLE\n         + `nullptr == hDisplayOutput`\n     - CTL_RESULT_ERROR_INVALID_NULL_POINTER\n         + `nullptr == pPanelDescriptorAccessArgs`\n     - ::CTL_RESULT_ERROR_UNSUPPORTED_VERSION - \"Unsupported version\"\n     - ::CTL_RESULT_ERROR_INVALID_OPERATION_TYPE - \"Invalid operation type\"\n     - ::CTL_RESULT_ERROR_INSUFFICIENT_PERMISSIONS - \"Insufficient permissions\"\n     - ::CTL_RESULT_ERROR_INVALID_NULL_POINTER - \"Invalid null pointer\"\n     - ::CTL_RESULT_ERROR_NULL_OS_DISPLAY_OUTPUT_HANDLE - \"Null OS display output handle\"\n     - ::CTL_RESULT_ERROR_NULL_OS_INTERFACE - \"Null OS interface\"\n     - ::CTL_RESULT_ERROR_NULL_OS_ADAPATER_HANDLE - \"Null OS adapter handle\"\n     - ::CTL_RESULT_ERROR_KMD_CALL - \"Kernal mode driver call failure\""]
    pub fn ctlPanelDescriptorAccess(
        hDisplayOutput: ctl_display_output_handle_t,
        pPanelDescriptorAccessArgs: *mut ctl_panel_descriptor_access_args_t,
    ) -> ctl_result_t;
}
#[doc = "\n @brief  Retro Scaling Types"]
pub type ctl_retro_scaling_type_flags_t = u32;
#[doc = "< Integer Scaling"]
pub const _ctl_retro_scaling_type_flag_t_CTL_RETRO_SCALING_TYPE_FLAG_INTEGER:
    _ctl_retro_scaling_type_flag_t = 1;
#[doc = "< Nearest Neighbour Scaling"]
pub const _ctl_retro_scaling_type_flag_t_CTL_RETRO_SCALING_TYPE_FLAG_NEAREST_NEIGHBOUR:
    _ctl_retro_scaling_type_flag_t = 2;
pub const _ctl_retro_scaling_type_flag_t_CTL_RETRO_SCALING_TYPE_FLAG_MAX:
    _ctl_retro_scaling_type_flag_t = -2147483648;
pub type _ctl_retro_scaling_type_flag_t = ::std::os::raw::c_int;
pub use self::_ctl_retro_scaling_type_flag_t as ctl_retro_scaling_type_flag_t;
#[doc = "\n @brief Set/Get Retro Scaling Type"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ctl_retro_scaling_settings_t {
    #[doc = "< [in] size of this structure"]
    pub Size: u32,
    #[doc = "< [in] version of this structure"]
    pub Version: u8,
    #[doc = "< [in][release] Set to true to get current scaling . Set to False to Set\n< the scaling"]
    pub Get: bool,
